[
  {
    "id": null,
    "text": "A 17-year-old complains of blurred distance vision that clears when she squints. Retinoscopy without lenses shows against-motion at distance that neutralizes with −3.00 D. Where are parallel rays focusing in her uncorrected eye?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Myopia",
    "rationale": "Myopic eyes focus parallel rays in front of the retina; squinting increases depth of focus but does not change the focal position.",
    "choices": [
      "In front of the retina",
      "On the retina",
      "Behind the retina",
      "Between the nodal points"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −5.00 D uncorrected myope removes her glasses and holds her phone at the clearest distance. Approximately where is she holding the phone relative to her eye?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Myopia",
    "rationale": "Far point = 1/|Rx| (meters). For −5.00 D, far point is 0.20 m (20 cm) in front of the eye.",
    "choices": [
      "~20 cm in front of the eye",
      "~50 cm in front of the eye",
      "~1 m behind the eye",
      "At optical infinity"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 23-year-old with −2.50 D myopia asks how glasses will help her. Which optical effect of the lens explains the improvement at distance?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Myopia",
    "rationale": "Minus lenses move the image plane posteriorly onto the retina by providing diverging vergence.",
    "choices": [
      "Minus lenses diverge incident light, effectively reducing the eye's power",
      "Minus lenses diverge incident light, effectively increasing the eye's power",
      "Minus lenses converge incident light, effectively reducing the eye's power",
      "Minus lenses converge incident light, effectively reducing the eye's power"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 15-year-old presents with progressive myopia and long axial length on biometry. Which mechanism best explains the refractive shift?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Myopia",
    "rationale": "Axial elongation places the retina behind the focal point for the existing optical power.",
    "choices": [
      "Retina positioned posterior to the focal point due to increased axial length",
      "Reduced axial length moving the retina anterior to the focal point of the eye",
      "Steepened cornea focusing light anterior to the retina with a typical axial length",
      "Natural lens focusing light anterior to the retina with a typical axial length"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 28-year-old −10.00 D myope presents for a dilated exam. What complication is she at comparatively higher risk for due to ocular stretching?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Myopia",
    "rationale": "High myopia stretches the retina, predisposing to lattice degeneration, retinal breaks, and detachment.",
    "choices": [
      "Retinal detachment",
      "Angle-closure glaucoma",
      "Optic neuritis",
      "Central serous chorioretinopathy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 33-year-old hyperope reports eyestrain at the end of the day without glasses. Where does her uncorrected eye focus parallel rays of light?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Hyperopia",
    "rationale": "Hyperopic eyes are underpowered; parallel rays focus behind the retina unless accommodation or plus lenses bring the focus forward.",
    "choices": [
      "Behind the retina",
      "On the retina",
      "In front of the retina",
      "On the corneal plane"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Biometry shows a shorter-than-average axial length in a patient whose cycloplegic refraction is +3.00 D. Which type of refractive error does this support?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Hyperopia",
    "rationale": "Axial hyperopia is caused by a short eye in relation to its optical power.",
    "choices": [
      "Axial hyperopia",
      "Axial myopia",
      "Refractive myopia",
      "Refractive hyperopia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A +2.50 D uncorrected hyperope looks at a distant street sign. Where is her far point located?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Hyperopia",
    "rationale": "Hyperopes have a virtual far point located behind the eye; plus lenses shift the focus onto the retina.",
    "choices": [
      "A virtual point behind the eye",
      "A virtual point in front of the eye",
      "A real point behind the eye",
      "A real ppoint in front of the eye"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 25-year-old with +2.00 D uncorrected hyperopia views a distance target. To see clearly without glasses, what must occur?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Hyperopia",
    "rationale": "At distance, an uncorrected hyperope must accommodate an amount equal to the uncorrected error.",
    "choices": [
      "She must accommodate an amount equal to her hyperopia",
      "No accommodation is required to see at distance",
      "She must accommodate half her refractive error",
      "In hyperopic patients, accommodation does not help with distance vision"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 62-year-old +3.00 D hyperope has shallow anterior chambers on gonioscopy. Which risk is anatomically increased?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Hyperopia",
    "rationale": "Shorter eyes tend to have crowded anterior segments and narrower angles, increasing angle-closure risk.",
    "choices": [
      "Angle-closure glaucoma",
      "Retinal detachment",
      "Pigment dispersion syndrome",
      "Myopic maculopathy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Keratometry shows principal meridians of different curvatures. Which definition best matches the optical state?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Astigmatism",
    "rationale": "Astigmatism arises from different powers in orthogonal meridians, creating two focal lines.",
    "choices": [
      "Astigmatism: unequal curvature between principal meridians",
      "Anisometropia: unequal refractive error between the eyes",
      "Presbyopia: loss of accommodative ability with age",
      "Aniseikonia: unequal image sizes between the eyes"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "During refraction, the best spherical-equivalent focus lies between the two focal lines of an astigmatic eye. What is this region called?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Astigmatism",
    "rationale": "The interval of Sturm is the dioptric distance between the two focal lines.",
    "choices": [
      "The interval of Sturm",
      "The nodal interval",
      "The lead of accommodation",
      "The lag of accommodation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You place the circle of least confusion at the retina to optimize vision in uncorrected mixed astigmatism. Where is this located optically?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Astigmatism",
    "rationale": "The circle of least confusion corresponds to the spherical-equivalent focus.",
    "choices": [
      "At the midpoint between focal lines",
      "At the anterior focal line",
      "Behind both focal lines",
      "At the posterior focal line"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A trial lens of −2.00 −3.00 × 180 is converted to its spherical equivalent for pinhole acuity prediction. Which formula do you apply?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Astigmatism",
    "rationale": "Spherical equivalent equals the sphere plus half the cylinder power.",
    "choices": [
      "SE = Sphere + (Cylinder/2)",
      "SE = Sphere − (Cylinder/2)",
      "SE = Cylinder + (Sphere/2)",
      "SE = Sphere × Cylinder"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You must transpose +2.00 −3.50 × 010 to plus cylinder form for ordering. What is the correct result?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Astigmatism",
    "rationale": "Add sphere and cylinder (−1.50), flip cylinder sign (+3.50), rotate axis 90° (010→100).",
    "choices": [
      "−1.50 +3.50 × 100",
      "−1.50 +3.50 × 010",
      "+2.00 −3.50 × 100",
      "−3.50 +2.00 × 100"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient is dispensed −10.00 D spectacles at a 15 mm vertex distance but later switches to contact lenses. Why does vision change if power is not vertex-compensated?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Vertex Distance",
    "rationale": "Moving the correction toward the cornea changes effective vergence; high absolute powers require vertex compensation.",
    "choices": [
      "Effective power changes with vertex distance",
      "Accommodation is eliminated with contacts",
      "Corneal curvature is no accounted for by glasses",
      "Pupil size controls effective power at distance"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You convert a −9.00 D contact lens to a spectacle Rx at 12 mm vertex distance. Which relationship should you use for the effective power at the new plane?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Vertex Distance",
    "rationale": "The effective power at a new plane is given by F2 = F1 / (1 − d·F1) with d in meters.",
    "choices": [
      "F2 = F1 / (1 − d·F1)",
      "F2 = F1 + d",
      "F2 = F1 × d",
      "F2 = F1 / (1 + d·F1)"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "For a −10.00 D contact lens moved to the 15 mm spectacle plane, which spectacle power best maintains the same vergence at the cornea?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Vertex Distance",
    "rationale": "F2 = −10 / (1 − 0.015×−10) ≈ −11.76 D; moving a minus lens away increases the minus power needed at the spectacle plane.",
    "choices": [
      "Approximately −11.75 D",
      "Approximately −10.25 D",
      "Approximately −9.50 D",
      "Approximately −12.50 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient's subjective refraction differs from the emmetropic power required by the eye. Which expression quantifies the refractive error if Factual is ocular power and Fneeded is emmetropic power?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Formulas",
    "rationale": "Refractive error represents the difference between the eye's actual power and the power needed for emmetropia.",
    "choices": [
      "Error = Factual − Fneeded",
      "Error = Fneeded − Factual",
      "Error = 1/Factual − 1/Fneeded",
      "Error = Factual × Fneeded"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Topography provides a corneal radius of 7.8 mm. Assuming n′ = 1.3375 and n = 1.000, which formula is used to estimate corneal power?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Formulas",
    "rationale": "The keratometric formula uses an equivalent index to approximate total corneal power from the anterior radius (r in meters).",
    "choices": [
      "F = (n′ − n)/r",
      "F = n/r",
      "F = (n′ × n)/r",
      "F = r/(n′ − n)"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −6.00 D myope seeks laser vision correction. Which primary corneal change from LASIK explains the refractive effect?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Refractive Surgery",
    "rationale": "Excimer ablation in the optical zone flattens corneal curvature, decreasing refractive power.",
    "choices": [
      "Flattening of the central cornea to reduce corneal power",
      "Steepening of the central cornea to increase power",
      "Flattening of the central cornea to increase corneal power",
      "Steepening of the central cornea to reduce corneal power"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with low hyperopia is counseled about conductive keratoplasty (CK). What is the intended optical outcome of the procedure?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Refractive Surgery",
    "rationale": "CK tightens the peripheral cornea with thermal spots, producing central steepening and a plus shift.",
    "choices": [
      "Peripheral steepening that increases central corneal power",
      "Central steepening that increases central corneal power",
      "Peripheral steepening that decreases central corneal power",
      "Central steepening that decreases central corneal powen"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You compare SMILE to LASIK for a −7.00 D myope with dry eye risk. Which key difference may reduce surface complications?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Refractive Surgery",
    "rationale": "SMILE is flapless (small incision), potentially preserving more corneal nerves and minimizing surface disruption.",
    "choices": [
      "SMILE removes an intrastromal lenticule",
      "SMILE uses a larger flap to preserve nerves",
      "SMILE is only indicated for hyperopia",
      "SMILE replaces the natural lens with an IOL"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −12.00 D myope with thin corneas is not a candidate for corneal laser surgery. Which refractive option most directly addresses high myopia without corneal ablation?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Refractive Surgery",
    "rationale": "ICLs correct high myopia by adding a posterior chamber phakic lens, avoiding corneal tissue removal.",
    "choices": [
      "Implantable collamer lens",
      "Conductive keratoplasty",
      "Monovision soft lenses",
      "Clear lens extraction"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 58-year-old hyperope with early presbyopia asks about refractive lens exchange (RLE). In which scenario is RLE particularly reasonable?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Refractive Surgery",
    "rationale": "RLE replaces the crystalline lens with an IOL and is often considered for high hyperopia/presbyopia when corneal procedures are less ideal.",
    "choices": [
      "High hyperopia and presbyopia with desire for IOL-based correction",
      "Low myopia without cataract and thick pachymetry readings",
      "Regular astigmatism under 1.00 D with thick pachymetry",
      "Anisometropia only with thick corneas with history of past contact lens wear"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 44-year-old accountant notes increasing near blur despite excellent distance vision. What age-related optical change most directly explains the symptoms?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Presbyopia",
    "rationale": "Presbyopia arises primarily from lenticular sclerosis and reduced elasticity, limiting accommodative amplitude.",
    "choices": [
      "Loss of lens elasticity reducing accommodative ability",
      "Ciliary muscle paralysis reducing accommodative ability",
      "Corneal steepening at the visual axis resutling in myopia",
      "Ocular sufrace disease creating a rough refractive surface"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You calculate a near add for a 48-year-old whose amplitude is 3.00 D and near target is at 40 cm. Which approach yields a balanced add?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Presbyopia",
    "rationale": "A common approach is for a patient to use half of their amplitude and apply the remaining demand to an ADD.",
    "choices": [
      "Add = (Accommodative demand) − Amplitude/2 = +1.00D ",
      "Add = (Accommodative demand − Amplitude)/2 = -0.50D ",
      "Add = Accommodative demand − Amplitude = +1.50D",
      "Add = Accommodative demand at working distance = 3.00D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A college student removes her −2.00 D glasses to read at 40 cm. Compared to an emmetrope, how does her accommodative demand change?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Accommodation",
    "rationale": "Residual myopia reduces the accommodation required for a given near distance.",
    "choices": [
      "Lower demand because her far point is closer than the target",
      "Higher demand due to residual hyperopic defocus",
      "Identical demand at 40 cm",
      "No accommodation possible without correction"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −3.00 D myope is accidentally over-minused by 0.75 D in new spectacles. At distance, how will the eye behave optically?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Accommodation",
    "rationale": "Over-minusing creates a hyperopic shift at distance, increasing accommodative demand.",
    "choices": [
      "Like a hyperope, requiring extra accommodation for distance",
      "Like an emmetrope with reduced accommodation",
      "Like a presbyope with no accommodation",
      "Like an astigmat with meridional blur only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "An under-corrected −1.50 D myope reads at 40 cm without strain. Compared to an emmetrope, what is true about her accommodative effort?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Accommodation",
    "rationale": "Residual minus power substitutes for some accommodative demand at near.",
    "choices": [
      "She requires less accommodative effort at 40 cm",
      "She requires more accommodative effort at 40 cm",
      "Her demand is identical",
      "She cannot accommodate at 40 cm"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A fully corrected −2.50 D myope with healthy accommodation views 33 cm print. Relative to an emmetrope, how does she accommodate?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Accommodation",
    "rationale": "With proper correction, accommodative demand equals that of an emmetrope at the same distance.",
    "choices": [
      "Like an emmetrope",
      "Less than an emmetrope",
      "More than a hyperope",
      "She cannot accommodate at all"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "During retinoscopy at 2 m, the object vergence at the cornea is −0.50 D. The corneal surface has power +43.00 D. Using the vergence relationship, what is image vergence immediately after the surface?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Formulas",
    "rationale": "The paraxial vergence formula is L′ = F + L.",
    "choices": [
      "L' = F + L = +42.50 D",
      "L' = F − L = +43.50 D",
      "L' = L − F = −43.50 D",
      "L' = 1/f' only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You need the spherical equivalent of −3.00 +2.00 × 180 for a pinhole VA prediction. What is the SE?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Astigmatism",
    "rationale": "SE = Sphere + (Cylinder/2) = −3.00 + (+2.00/2) = −2.00 D.",
    "choices": [
      "−2.00 D",
      "−3.00 D",
      "−4.00 D",
      "−1.00 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −3.00 D uncorrected myope holds reading material at 33 cm. How much accommodation is required to keep the target clear at that distance?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Accommodation",
    "rationale": "The far point of a −3.00 D myope is 33 cm; objects at the far point are clear without additional accommodation.",
    "choices": [
      "0 D",
      "1 D",
      "3 D",
      "4 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 29-year-old with mixed astigmatism improves during fogging before cylinder refinement. Which optical principle best explains this?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Astigmatism",
    "rationale": "Fogging places the circle of least confusion nearer the retina, stabilizing endpoint for cylinder refinement.",
    "choices": [
      "Shifting the circle of least confusion toward the retina before refining cylinder",
      "Inducing spherical aberration to sharpen the image",
      "Reducing chromatic aberration via blue light",
      "Changing axial length by accommodation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with −8.00 D spectacles reports that the same nominal power feels stronger than their contact lenses. What explains this phenomenon?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Vertex Distance",
    "rationale": "For high minus, moving the lens away from the eye (spectacle plane) increases the effective minus power.",
    "choices": [
      "Vertex distance increases the effective minus power of spectacles compared to the corneal plane",
      "Accommodation is disabled by spectacles",
      "Spectacles increase corneal refractive index",
      "Contacts add plus power at distance"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "During a pre-op refractive surgery consult, you warn a patient with large pupils about night halos. Which factor most contributes to night myopia and halos?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Clinical Optics",
    "rationale": "Low luminance reduces depth of focus; larger pupils expose more peripheral aberrations, increasing halos and myopic shift.",
    "choices": [
      "Accommodation overshoot and higher-order aberrations with larger pupils",
      "Spectacle magnification in dim light",
      "Reduced Abbe number at night",
      "Anterior shift of the retina in darkness"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A keratometry-to-power conversion uses n′ = 1.3375 to account for the posterior cornea. What is the practical rationale for using this 'keratometric index'?",
    "discipline": "Optics",
    "condition": "Ametropia",
    "sub": "Formulas",
    "rationale": "An equivalent index estimates total corneal power from the anterior radius alone by implicitly modeling posterior power.",
    "choices": [
      "It approximates total corneal power without directly measuring the posterior surface",
      "It corrects for chromatic aberration in green light",
      "It standardizes vertex distance assumptions",
      "It eliminates the need for axial length measurement"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 74-year-old with GA from dry AMD reports that brighter task lighting and a yellow-tinted reading lamp make newspaper headlines easier to see, but small print is still difficult. What is the primary goal of low vision rehabilitation you should emphasize when counseling her plan?",
    "discipline": "Optics",
    "condition": "Low Vision",
    "sub": "Rehabilitation Goals",
    "rationale": "Low vision rehab focuses on leveraging remaining vision-through magnification, lighting, and contrast-rather than restoring normal acuity.",
    "choices": [
      "Maximize residual visual function using magnification, optimized illumination, and contrast enhancements",
      "Restore emmetropia surgically to eliminate optical devices",
      "Eliminate the need for refraction by relying on non-optical strategies only",
      "Reduce dependence on magnifiers by prescribing stronger distance glasses"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 68-year-old with central scotoma wants to read pill bottles. At 40 cm his print is too small. You recommend moving the label closer while using a stand lamp. If he brings the label from 40 cm to 16 cm, what relative-distance magnification (RDM) has he achieved?",
    "discipline": "Optics",
    "condition": "Low Vision",
    "sub": "Magnification Strategies",
    "rationale": "RDM = old WD / new WD = 40/16 = 2.5×. Moving the target closer increases angular size at the eye.",
    "choices": [
      "2.5×",
      "1.6×",
      "0.4×",
      "4×"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You're estimating the starting add for a 72-year-old who wants to read large-print books at 25 cm. He can tolerate a 25 cm working distance. To keep the frame simple initially, which approximate equivalent power at the spectacle plane best matches this goal (ignoring accommodation)?",
    "discipline": "Optics",
    "condition": "Low Vision",
    "sub": "Magnification Strategies",
    "rationale": "Working distance (m) ≈ 1/F. At 25 cm, F ≈ +4.00 D. This provides a reasonable starting point with minimal posture strain.",
    "choices": [
      "+4.00 D readers with good task lighting",
      "+2.50 D readers at 40 cm",
      "+6.00 D readers at 16-17 cm",
      "+10.00 D microscope at 10 cm"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with BCVA 20/160 wants to access 20/40-equivalent print on a tablet. Using the MAR relationship, about how much angular magnification is required to reach that goal if acuity scales inversely with MAR?",
    "discipline": "Optics",
    "condition": "Low Vision",
    "sub": "MAR & Snellen",
    "rationale": "MAR = denominator/numerator. 20/160 → MAR 8; 20/40 → MAR 2. Required magnification ≈ 8/2 = 4×.",
    "choices": [
      "4×",
      "2×",
      "8×",
      "0.25×"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You are selecting a distance telescope for spotting bus numbers. The patient wants the lightest, shortest option that provides an erect image without an internal image inverter. Which design best matches this request?",
    "discipline": "Optics",
    "condition": "Low Vision",
    "sub": "Telescopes",
    "rationale": "Galilean systems use a +objective and −ocular, are compact/light, and form an erect image without prisms-ideal for brief spotting tasks.",
    "choices": [
      "Galilean telescope with a plus objective and minus ocular",
      "Keplerian telescope with two plus lenses and erecting prisms",
      "Compound monocular with Porro prisms",
      "Keplerian telescope without any erecting system"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A pocket telescope uses a +20.00 D objective and a −80.00 D ocular. Based on lens powers, what is the nominal angular magnification and image orientation?",
    "discipline": "Optics",
    "condition": "Low Vision",
    "sub": "Telescopes",
    "rationale": "For telescopes, M ≈ −Focular/Fobjective. Here, −(−80)/20 = +4×. A Galilean design yields an erect image.",
    "choices": [
      "4× erect",
      "4× inverted",
      "0.25× erect",
      "−4× inverted"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 79-year-old with advanced geographic atrophy reads 20/200 at 40 cm. You convert to MAR to explain why increasing print size or magnification helps. Which expression correctly links Snellen to MAR for patient education?",
    "discipline": "Optics",
    "condition": "Low Vision",
    "sub": "MAR & Snellen",
    "rationale": "MAR is the ratio of Snellen denominator to numerator (e.g., 20/200 → MAR 10). It scales with the print size needed for resolution.",
    "choices": [
      "MAR = Snellen denominator / Snellen numerator",
      "MAR = Snellen numerator / Snellen denominator",
      "MAR = 1 / Snellen fraction",
      "MAR = 20 / Snellen denominator only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −8.00 D spectacle lens is moved from 12 mm to 15 mm from the cornea. Using the effective power formula, what is the new effective power at the spectacle plane? (Assume d in meters)",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Vertex Distance",
    "rationale": "F2 = F1 / (1 − d·F1). For F1 = −8.00 and d = 0.015, F2 ≈ −8.25 D, meaning slightly more minus at the increased vertex distance.",
    "choices": [
      "−8.25 D",
      "−7.75 D",
      "−8.50 D",
      "−8.00 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −5.00 D patient's eyes move 5 mm away from the optical center horizontally. Calculate the induced prism using Prentice's Rule.",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Prentice's Rule",
    "rationale": "Δ = c·F = 0.5 cm × 5.00 D = 2.5Δ. Minus lenses induce base-in when viewing nasally.",
    "choices": [
      "2.5Δ base-in",
      "2.5Δ base-out",
      "0.5Δ base-in",
      "5Δ base-out"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A +8.00 D lens has a vertex distance of 15 mm. What is the approximate effective power if moved to 10 mm?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Vertex Distance",
    "rationale": "Moving a plus lens closer decreases effective power. F2 = F1 / (1 − d·F1) = +8 / (1 − 0.005×8) ≈ +7.9 D.",
    "choices": [
      "+7.90 D",
      "+8.10 D",
      "+8.50 D",
      "+9.00 D"
    ],
    "correct": 1
  },
  {
    "id": null,
    "text": "A +6.00 D spectacle lens with center thickness 6 mm and front curve +10.00 D has a shape factor magnification of approximately what? (n = 1.5)",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Magnification",
    "rationale": "Shape factor ≈ 1 + (t/n)·F1 = 1 + (0.006/1.5)×10 ≈ 1.04×.",
    "choices": [
      "1.04×",
      "1.06×",
      "1.10×",
      "1.00×"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −4.00 D lens is decentered 3 mm horizontally outward. Using Prentice's Rule, find the induced prism and base direction.",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Prentice's Rule",
    "rationale": "Δ = c·F = 0.3 cm × 4.00 = 1.2Δ base-in for a minus lens decentered outward.",
    "choices": [
      "1.2Δ base-in",
      "1.2Δ base-out",
      "0.3Δ base-in",
      "0.3Δ base-out"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A +3.00 D lens is 4 mm above the pupil center. What vertical prismatic effect occurs in primary gaze?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Prism Effects",
    "rationale": "Δ = c·F = 0.4 cm × 3.00 = 1.2Δ. Viewing through a point above the optical center of a plus lens induces base-down prism.",
    "choices": [
      "1.2Δ base-down",
      "1.2Δ base-up",
      "0.6Δ base-up",
      "No effect"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Two lenses have powers +6.00 D and +3.00 D. The patient reads at near through bifocals. Assuming the near point is 10 mm below the OC, what is the vertical imbalance?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Anisometropia",
    "rationale": "Prism difference = ΔF × c = (6−3)×1.0 cm = 3Δ. The more plus lens induces base-up prism at near.",
    "choices": [
      "3Δ base-up in the more plus eye",
      "3Δ base-down in the more plus eye",
      "6Δ base-up in the more plus eye",
      "No imbalance"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 10Δ base-out Fresnel prism is placed before an eye with PD 65 mm for 6 m distance target. What lateral deviation in cm does this produce on the retinal plane?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Prism",
    "rationale": "1Δ = 1 cm deviation at 1 m. At 6 m, 10Δ → 10 cm at 6 m = ~0.6 cm deviation at the eye.",
    "choices": [
      "0.6 cm deviation",
      "6 cm deviation",
      "0.1 cm deviation",
      "1 cm deviation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient uses +12.00 D aphakic spectacles. What approximate ring scotoma angle (in degrees) occurs if the lens diameter is 50 mm? (Assume 2 mm edge separation for prismatic effect.)",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Field Effects",
    "rationale": "High-plus lenses induce ~1Δ per mm at the edge; 12Δ ≈ 12°, approximating ring scotoma extent.",
    "choices": [
      "~12°",
      "~20°",
      "~5°",
      "~30°"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with −9.00 D glasses reports that lines appear curved at the periphery. Which aberration best explains this?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Aberrations",
    "rationale": "High-minus lenses create barrel distortion (peripheral minification), bending straight lines inward.",
    "choices": [
      "Barrel distortion from high-minus lenses",
      "Pincushion distortion from high-minus lenses",
      "Chromatic aberration from Abbe value",
      "Oblique astigmatism from aspheric design"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A high hyperope switches to contacts and notes a wider field of view. What causes this change?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Field Effects",
    "rationale": "High-plus spectacles magnify and narrow the field; contact lenses remove this magnification and base-out prism, expanding the field.",
    "choices": [
      "Elimination of spectacle magnification and prismatic base-out effect",
      "Decrease in effective power due to tear film",
      "Reduction in oblique astigmatism",
      "Loss of peripheral refraction"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient reports colored fringes around bright lights with polycarbonate lenses. What optical factor explains this?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Chromatic Aberration",
    "rationale": "Polycarbonate has a low Abbe number (~30), causing noticeable dispersion and color fringing under high-contrast conditions.",
    "choices": [
      "Low Abbe value increases chromatic aberration",
      "Spherical aberration at the optical center",
      "Oblique astigmatism due to lens tilt",
      "Decentration of lens PD"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −7.00 D patient is fitted with flatter base curve lenses to reduce weight. What secondary effect may occur?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Base Curve",
    "rationale": "Flatter base curves reduce lens thickness and magnification but can increase peripheral aberrations in high-power lenses.",
    "choices": [
      "Increased peripheral aberrations",
      "Reduced chromatic dispersion",
      "Elimination of barrel distortion",
      "Magnification increase"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 50-year-old presbyope complains of blurred near vision with progressives when turning eyes side to side. What should you explain?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Progressive Lenses",
    "rationale": "Peripheral areas of progressives contain surface astigmatism; clear vision requires looking through the narrow central corridor.",
    "choices": [
      "Progressive lenses have peripheral astigmatism outside the corridor",
      "Lens tilt changes add power",
      "Material index reduces field of view",
      "Pantoscopic tilt induces prism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with +10.00 D aphakic lenses complains of missing parts of the visual field near the periphery. Which best describes this?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Field Effects",
    "rationale": "High-plus lenses produce base-out prism peripherally, creating a ring scotoma where overlapping fields are lost.",
    "choices": [
      "Ring scotoma from base-out prismatic effect",
      "Oblique astigmatism at the edge",
      "Increased depth of field",
      "Chromatic spread at the edge"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −4.00 D lens is fit with a 10° pantoscopic tilt. What is the approximate induced cylinder and axis change?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Lens Tilt",
    "rationale": "Tilting a spherical lens induces minus cylinder 90° from the axis of tilt; 10° tilt on a −4.00 D lens ≈ −0.25 D at 90°.",
    "choices": [
      "~−0.25 D cyl at 180°",
      "~−0.25 D cyl at 90°",
      "~−0.50 D cyl at 180°",
      "~−0.50 D cyl at 90°"
    ],
    "correct": 1
  },
  {
    "id": null,
    "text": "A +5.00 D lens has a power error of +0.25 D when tilted 15° horizontally. What adjustment minimizes this aberration?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Aberrations",
    "rationale": "Power error increases with tilt; minimizing tilt or using aspheric lenses controls induced aberration.",
    "choices": [
      "Reduce pantoscopic tilt or use an aspheric design",
      "Switch to high-index material",
      "Increase base curve curvature",
      "Add +0.25 D to compensate"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient complains of 'jump' when looking from distance to bifocal. Which bifocal segment style minimizes image jump?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Bifocal Design",
    "rationale": "Round-top and executive designs position the segment optical center closer to the dividing line, minimizing image jump.",
    "choices": [
      "Round-top or executive design",
      "Flat-top 28",
      "Ultex design",
      "Trifocal with intermediate power"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with anisometropia (+4.00 D OD, +1.00 D OS) reports headaches with glasses. Which issue should be suspected?",
    "discipline": "Optics",
    "condition": "Ophthalmic Optics / Spectacles",
    "sub": "Aniseikonia",
    "rationale": "Unequal magnification between the two lenses in anisometropia causes aniseikonia, producing headaches and asthenopia.",
    "choices": [
      "Aniseikonia from unequal image magnification",
      "Anisocoria affecting convergence",
      "Vertical prism imbalance at distance",
      "Astigmatic blur from off-axis gaze"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 27-year-old soft contact lens wearer reports afternoon dryness and blur. The lenses appear coated with debris. What is the most likely contributing factor?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Deposits / Dryness",
    "rationale": "Tear film instability increases deposition and surface dryness, leading to reduced wettability and visual fluctuations.",
    "choices": [
      "Protein and lipid deposition from tear film instability",
      "Incorrect base curve causing tight fit",
      "Over-minused spectacle refraction",
      "Incomplete blinking only during morning hours"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with seasonal allergies reports lens awareness and itching. Which lens material adjustment can improve comfort?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Allergy Management",
    "rationale": "Daily disposables minimize allergen buildup and eliminate the need for solutions that may cause irritation.",
    "choices": [
      "Daily disposable silicone hydrogel lenses",
      "High-water ionic monthly lenses",
      "Extended-wear low-Dk hydrogel",
      "Rigid PMMA lenses"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You fit a −6.00 D spectacle wearer with contact lenses at 12 mm vertex distance. What approximate CL power should be prescribed?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Vertex Conversion",
    "rationale": "For minus lenses, effective power decreases when moved closer. F2 = F1 / (1 − d·F1) ≈ −5.5 D.",
    "choices": [
      "−5.50 D",
      "−6.25 D",
      "−6.00 D",
      "−5.00 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A soft contact lens labeled −3.00 D at 8.6 BC is steepened to 8.3 BC. How does this affect fit?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Lens Fit",
    "rationale": "A smaller base curve increases sagittal depth, tightening the lens and reducing mobility.",
    "choices": [
      "Lens fits tighter with reduced movement",
      "Lens fits looser with increased movement",
      "No change in fit",
      "Central pooling decreases"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You note inferior decentration of a soft toric lens. Which adjustment will most improve stability?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Toric Lens Design",
    "rationale": "Additional prism ballast or stabilization zones increase vertical stability and minimize rotation.",
    "choices": [
      "Increase prism ballast or thickness differential",
      "Flatten the base curve further",
      "Use a higher water content material",
      "Switch to a spherical lens"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A keratoconic patient has K readings of 45.00/52.00 D. What approximate base curve (in mm) would you start with for a rigid lens trial?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Keratoconus Fitting",
    "rationale": "A base curve slightly flatter than the steep K is selected. 52 D → 6.49 mm; fitting flatter by ~1 mm gives ~7.8 mm.",
    "choices": [
      "7.8 mm",
      "8.3 mm",
      "8.6 mm",
      "9.0 mm"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −5.00 D GP lens is fitted 0.10 mm flatter than K. What tear lens power is produced (approximate)?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Tear Lens Power",
    "rationale": "A flatter-than-K fit produces a negative tear lens. 0.10 mm ≈ 0.50 D flatter → −0.50 D tear lens.",
    "choices": [
      "+0.50 D",
      "−0.50 D",
      "+1.00 D",
      "−1.00 D"
    ],
    "correct": 1
  },
  {
    "id": null,
    "text": "A scleral lens has a central clearance of 300 μm initially. After 6 hours, OCT shows 150 μm. What percent of vault reduction occurred?",
    "discipline": "Optics",
    "condition": "Contact Lenses",
    "sub": "Scleral Fit",
    "rationale": "Vault loss = (300−150)/300 = 50% settling; expected settling over time is typically 100-150 μm (≈50%).",
    "choices": [
      "50%",
      "25%",
      "33%",
      "75%"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 23-year-old emmetrope reads at 40 cm. What is the accommodative demand at that distance?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Accommodative Demand",
    "rationale": "Demand = 1 / distance (m). At 0.40 m, demand = 1/0.40 = 2.50 D.",
    "choices": [
      "+2.50 D",
      "+4.00 D",
      "+1.50 D",
      "+3.00 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A −2.00 D myope removes her glasses to read at 40 cm. What accommodative effort is required?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Accommodative Demand",
    "rationale": "Her far point is 0.5 m (1/2.00). Reading at 0.4 m requires 2.50 D − 2.00 D = 0.50 D of accommodation.",
    "choices": [
      "0.50 D",
      "2.00 D",
      "2.50 D",
      "0 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A hyperope with +3.00 D uncorrected error views a target at 33 cm. What total accommodation must be exerted to maintain clarity?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Accommodative Demand",
    "rationale": "The target at 33 cm requires 3.00 D of accommodation; adding +3.00 D hyperopia totals 6.00 D of accommodative effort.",
    "choices": [
      "+6.00 D",
      "+3.00 D",
      "+2.00 D",
      "+4.00 D"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient demonstrates a near phoria of 6Δ exo and a distance phoria of 2Δ exo with a 4 D stimulus to accommodation between 6 m and 40 cm. Calculate the AC/A ratio.",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "AC/A Ratio",
    "rationale": "Change in phoria = 6 − 2 = 4Δ over 4 D stimulus → AC/A = 4/4 = 1 Δ/D.",
    "choices": [
      "1.0 Δ/D",
      "2.0 Δ/D",
      "4.0 Δ/D",
      "8.0 Δ/D"
    ],
    "correct": 1
  },
  {
    "id": null,
    "text": "A patient's interpupillary distance is 64 mm. At 40 cm, what is the required convergence in prism diopters?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Vergence",
    "rationale": "Convergence (Δ) = PD (cm) / target distance (m). PD = 6.4 cm, distance = 0.40 m → 6.4 / 0.40 = 16Δ.",
    "choices": [
      "16Δ",
      "10Δ",
      "6Δ",
      "25Δ"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "During near testing, a patient reports diplopia at 8 cm. What is his near point of convergence (NPC)?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Vergence",
    "rationale": "The closest point of single binocular vision is the NPC; diplopia at 8 cm means convergence breaks at that distance.",
    "choices": [
      "8 cm",
      "10 cm",
      "12 cm",
      "5 cm"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 25-year-old complains of eyestrain when reading but has normal amplitude of accommodation. What dysfunction should be suspected?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Vergence Dysfunction",
    "rationale": "Normal accommodation with near strain and receded NPC suggests convergence insufficiency.",
    "choices": [
      "Convergence insufficiency",
      "Accommodative insufficiency",
      "Accommodative spasm",
      "Basic esophoria"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with accommodative spasm shows variable retinoscopy reflex and intermittent esotropia. What mechanism best explains this?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Accommodative Spasm",
    "rationale": "Accommodative spasm produces pseudomyopia and intermittent esotropia from overactive accommodation and AC/A-driven convergence.",
    "choices": [
      "Excess accommodation driving excess convergence",
      "Poor fusional divergence ability",
      "Weak AC/A ratio",
      "Unstable tear film causing blur"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient's base-out vergence ranges at near are 20/30/20 (blur/break/recovery). What does this suggest?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Vergence Ranges",
    "rationale": "High base-out ranges indicate strong fusional convergence; typically base-out break >20Δ is adequate.",
    "choices": [
      "Good fusional convergence with adequate reserves",
      "Poor fusional divergence",
      "Excess divergence reserve",
      "Insufficient accommodation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 28-year-old demonstrates difficulty maintaining fixation during pursuits, especially when tracking moving targets across midline. Which system is primarily deficient?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Oculomotor Control",
    "rationale": "Smooth pursuits maintain steady fixation on moving objects; poor pursuit control leads to corrective saccades and reduced tracking accuracy.",
    "choices": [
      "Smooth pursuit oculomotor system",
      "Saccadic system",
      "Vestibulo-ocular reflex",
      "Optokinetic response"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 12-year-old with reading difficulty overshoots targets during fixation shifts and requires corrective return movements. What oculomotor finding does this represent?",
    "discipline": "Optics",
    "condition": "Accommodation / Vergence / Oculomotor",
    "sub": "Saccades",
    "rationale": "Overshooting and corrective saccades are characteristic of saccadic dysmetria, common in oculomotor dysfunctions affecting reading fluency.",
    "choices": [
      "Saccadic dysmetria",
      "Convergence excess",
      "Reduced AC/A ratio",
      "Fixation disparity"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 6-year-old presents with best-corrected VA of 20/40 OD and 20/20 OS despite full optical correction. No pathology is seen. What type of amblyopia is most likely?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Anisometropia",
    "rationale": "Unequal refractive error causes chronic defocus in one eye leading to anisometropic amblyopia without visible pathology.",
    "choices": [
      "Anisometropic amblyopia",
      "Strabismic amblyopia",
      "Deprivation amblyopia",
      "Isoametropic amblyopia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 5-year-old has a 25Δ constant esotropia with fixation preference OS. Suppression is noted on Worth 4-dot testing. What sensory adaptation allows single vision without diplopia?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Suppression",
    "rationale": "Suppression eliminates diplopia by ignoring the image from the deviating eye within the region of binocular overlap.",
    "choices": [
      "Suppression scotoma in the deviating eye",
      "Anomalous retinal correspondence",
      "Torsional adaptation",
      "Central fusion disruption"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "During cover testing, a 4-year-old shows refixation only when the right eye is covered, indicating a left eye deviation. What type of deviation is this?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Cover Test",
    "rationale": "If the right eye fixates and movement occurs when it is covered, the left eye is deviated inward-left esotropia.",
    "choices": [
      "Left esotropia",
      "Left exotropia",
      "Right esotropia",
      "Right exotropia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A child with uncorrected +5.00 D hyperopia presents with 20Δ esotropia that decreases with near target viewing. Which mechanism explains this?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Accommodative Esotropia",
    "rationale": "Excess accommodation to overcome hyperopia drives excess convergence via a high AC/A ratio, producing esotropia.",
    "choices": [
      "High accommodative convergence from uncorrected hyperopia",
      "Poor fusional divergence at near",
      "Mechanical restriction of lateral rectus",
      "Sensory exotropia adaptation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 6-year-old has 15Δ constant esotropia at distance and 30Δ at near. Calculate the AC/A ratio given a 2.50 D near stimulus difference.",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "AC/A Ratio",
    "rationale": "Change in deviation = 30 − 15 = 15Δ. Divide by 2.5 D stimulus → 15/2.5 = 6:1 AC/A ratio, indicating high accommodative convergence.",
    "choices": [
      "6:1",
      "4:1",
      "2:1",
      "8:1"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You prescribe +2.00 D bifocals to a patient with high AC/A accommodative esotropia showing 25Δ near and 10Δ distance ET. What should happen at near?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Accommodative Esotropia",
    "rationale": "Plus lenses reduce accommodative effort, decreasing convergence drive and thereby reducing near esotropia.",
    "choices": [
      "Near deviation should decrease",
      "Distance deviation should increase",
      "Deviation will remain unchanged",
      "Exotropia will develop"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 4-year-old with right esotropia is treated with alternate patching 2 hr/day for 6 months. Visual acuity equalizes OU but deviation persists. What is the next management step?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Treatment",
    "rationale": "Once amblyopia resolves but alignment remains abnormal, surgical alignment is considered to restore binocularity.",
    "choices": [
      "Maintain optical correction and consider strabismus surgery",
      "Stop patching completely",
      "Prescribe additional plus lenses",
      "Add base-out prism to stimulate fusion"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 7-year-old has 4Δ intermittent exotropia controlled with convergence exercises. What fusional vergence type strengthens with such therapy?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Vergence Therapy",
    "rationale": "Convergence (base-out) training increases positive fusional vergence, improving control of intermittent exotropia.",
    "choices": [
      "Positive fusional vergence",
      "Negative fusional vergence",
      "Torsional vergence",
      "Vertical vergence"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "During prism alternate cover testing, a patient neutralizes motion with 12Δ BO OD and 14Δ BO OS. What is the angle of deviation?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Prism Cover Test",
    "rationale": "Both eyes require base-out prism to neutralize-indicating esotropia. The average of 12 and 14 = 13Δ esotropia.",
    "choices": [
      "13Δ esotropia",
      "13Δ exotropia",
      "26Δ esotropia",
      "26Δ exotropia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with right hypertropia measures 8Δ on primary gaze and 2Δ on left gaze. Which muscle is likely underacting?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Muscle Palsy",
    "rationale": "Right hypertropia decreasing in left gaze suggests underaction of the right inferior oblique or overaction of left superior rectus; inferior oblique underaction fits best.",
    "choices": [
      "Right superior rectus",
      "Right inferior oblique",
      "Left superior rectus",
      "Left inferior rectus"
    ],
    "correct": 1
  },
  {
    "id": null,
    "text": "A 9-year-old with intermittent exotropia has excellent stereoacuity when aligned but breaks at near after 15 seconds. What does this indicate?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Control / Fusion",
    "rationale": "Loss of fusion after brief alignment indicates intermittent exotropia with weak fusional convergence control.",
    "choices": [
      "Decompensated control with loss of fusional convergence",
      "Constant exotropia",
      "High AC/A esotropia",
      "Latent nystagmus"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "You measure a deviation of 20Δ on cover test. What power of Fresnel prism would you apply to achieve neutralization at 1 m (approximately)?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Prism Therapy",
    "rationale": "One prism diopter deflects light 1 cm per meter. A 20Δ deviation requires ~20Δ prism to neutralize at 1 m.",
    "choices": [
      "20Δ prism",
      "10Δ prism",
      "5Δ prism",
      "40Δ prism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A child with deprivation amblyopia from congenital cataract is left untreated until age 4. Despite surgery, visual improvement is limited. Why?",
    "discipline": "Anatomy",
    "condition": "Amblyopia / Strabismus",
    "sub": "Deprivation Amblyopia",
    "rationale": "Delayed visual input during the critical period causes cortical suppression; beyond that window, recovery is limited even with clear optics.",
    "choices": [
      "Visual cortex plasticity declines after early childhood",
      "Macular scarring prevents improvement",
      "Residual refractive error limits clarity",
      "Ocular dominance shifts can always be reversed"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 12-year-old reports difficulty identifying red and green traffic lights but normal blue perception. Which color vision defect is most likely?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Congenital Deficiency",
    "rationale": "Deuteranopia results in poor green discrimination with normal blue-yellow perception.",
    "choices": [
      "Deuteranopia",
      "Protanopia",
      "Tritanopia",
      "Monochromatism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "On Ishihara testing, a patient correctly identifies plates 1-10 but misses 11-14. What type of deficiency is suggested?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Screening",
    "rationale": "Missing later plates indicates mild deutan or protan defect since early screening plates are easier to distinguish.",
    "choices": [
      "Mild red-green defect",
      "Severe red-green defect",
      "Blue-yellow defect",
      "Monochromatism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "An anomaloscope match requires more red in the mixture field to match yellow. Which type of color defect does this indicate?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Anomaloscope",
    "rationale": "Deuteranomalous observers have reduced green sensitivity, requiring more red to match the mixture field.",
    "choices": [
      "Deuteranomaly",
      "Protanomaly",
      "Tritanomaly",
      "Normal trichromacy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 6-year-old fails Ishihara testing but performs normally on Hardy-Rand-Rittler plates. What does this suggest?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Screening Comparison",
    "rationale": "HRR plates test blue-yellow discrimination; normal HRR with failed Ishihara suggests tritan or blue defect.",
    "choices": [
      "A blue-yellow (tritan) defect",
      "A malingering case",
      "Monocular color blindness",
      "Severe red-green anomaly"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A male patient's father is color-normal and his mother is a carrier of a red-green defect. What is the probability he will be color-deficient?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Genetics",
    "rationale": "Red-green defects are X-linked recessive; a carrier mother gives a 50% chance to affected sons.",
    "choices": [
      "50%",
      "25%",
      "100%",
      "0%"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In congenital protanopia, how does brightness perception of red objects compare to normal?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Protan Defect",
    "rationale": "Protanopes lack long-wavelength (red) cones, so reds appear darker due to loss of brightness sensitivity.",
    "choices": [
      "Reduced brightness",
      "Increased brightness",
      "No difference",
      "Varies with illumination"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient exposed to ethambutol for 6 months develops bilateral color vision loss and central scotomas. Which type of defect is typical?",
    "discipline": "Pharmacology",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Toxic Optic Neuropathy",
    "rationale": "Ethambutol toxicity typically causes acquired blue-yellow defects with central visual field loss.",
    "choices": [
      "Acquired blue-yellow defect",
      "Congenital red-green defect",
      "Mixed congenital-acquired defect",
      "Normal trichromacy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 25-year-old reports difficulty distinguishing pale blue and gray under dim lighting. What physiological principle explains this?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Purkinje Phenomenon",
    "rationale": "Under scotopic conditions, rods dominate and sensitivity shifts toward shorter wavelengths, making blues appear brighter.",
    "choices": [
      "Purkinje shift toward blue sensitivity at low luminance",
      "Loss of cone function in mesopic light",
      "Increased rod saturation",
      "Equal rod and cone response to short wavelengths"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient's contrast sensitivity curve peaks at 4 cycles/degree but drops rapidly at 12 cycles/degree. What does this indicate?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Spatial Frequency",
    "rationale": "Loss of high-frequency sensitivity indicates reduced fine detail resolution, possibly from optical blur or early macular changes.",
    "choices": [
      "Mild loss of fine spatial resolution",
      "Normal spatial vision",
      "Severe retinal disease",
      "High contrast adaptation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with amblyopia shows normal Snellen acuity but abnormal contour interaction on a crowding test. What perceptual process is impaired?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Crowding",
    "rationale": "Amblyopia affects higher-level cortical processing of crowded visual fields, even when single-letter acuity appears normal.",
    "choices": [
      "Spatial integration and cortical processing",
      "Optical resolution at the retina",
      "Contrast sensitivity",
      "Accommodation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with optic neuritis is tested on the Farnsworth D-15. He arranges hues in a nonspecific scattered pattern. What does this suggest?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Acquired Defects",
    "rationale": "Acquired optic neuropathies often produce diffuse, nonspecific hue discrimination loss on arrangement tests.",
    "choices": [
      "Diffuse acquired dyschromatopsia",
      "Protanopia",
      "Deuteranomaly",
      "Tritanopia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "When measuring color discrimination, why is the Nagel anomaloscope considered superior to pseudoisochromatic plates?",
    "discipline": "Anatomy",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Testing",
    "rationale": "Anomaloscopes provide a continuous mixture scale to measure type and severity of red-green anomalies, unlike screening plates.",
    "choices": [
      "It quantifies defect severity precisely",
      "It can detect tritan defects",
      "It uses additive color mixing of blue and yellow",
      "It is resistant to malingering"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 30-year-old with early glaucoma demonstrates loss of sensitivity to low spatial frequency gratings. What visual pathway is primarily affected?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Perceptual Function / Color Vision",
    "sub": "Contrast Sensitivity",
    "rationale": "The magnocellular pathway mediates motion and low spatial frequency contrast; early glaucoma preferentially affects this pathway.",
    "choices": [
      "Magnocellular pathway",
      "Parvocellular pathway",
      "Koniocellular pathway",
      "Rod photoreceptor pathway"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A newborn demonstrates poor fixation but begins following faces by 6 weeks of age. This developmental milestone is primarily due to maturation of which visual pathway?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Visual Pathway Maturation",
    "rationale": "The magnocellular pathway develops earlier and mediates motion detection and tracking behavior in early infancy.",
    "choices": [
      "Magnocellular",
      "Parvocellular",
      "Koniocellular",
      "Rhodopsin-dependent"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "At what approximate age does stereopsis typically emerge in normal visual development?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Stereopsis Development",
    "rationale": "Binocular disparity detection and cortical fusion develop between 3-5 months, marking the onset of stereopsis.",
    "choices": [
      "3-5 months",
      "6-8 months",
      "12 months",
      "18 months"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 4-year-old child demonstrates intermittent suppression on stereo testing. What does this suggest about cortical plasticity at this age?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Critical Period",
    "rationale": "At age 4, visual cortex remains plastic; suppression and amblyopia can still be reversed with appropriate therapy.",
    "choices": [
      "Still within critical period for binocularity",
      "Critical period fully closed",
      "Cortical suppression is permanent",
      "Binocular integration is complete"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with early-onset esotropia shows loss of fusion and stereopsis. What aspect of development was disrupted?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Binocular Development",
    "rationale": "Constant strabismus in early life prevents normal cortical fusion, disrupting binocular neural connections during the sensitive period.",
    "choices": [
      "Sensitive period for binocular vision",
      "Retinal photoreceptor maturation",
      "Ocular motor development",
      "Refractive emmetropization"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 2-month-old has a fixation preference for one eye but otherwise normal ocular health. Why is early alternation of occlusion important?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Amblyopia Prevention",
    "rationale": "Alternating occlusion encourages use of both eyes, preventing cortical suppression and deprivation amblyopia.",
    "choices": [
      "To prevent suppression and amblyopia in the non-preferred eye",
      "To stimulate tear production",
      "To strengthen accommodation",
      "To enhance saccadic accuracy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 5-year-old exhibits an accommodative lag of +1.50 D on MEM retinoscopy. Which stage of near vision development does this most likely represent?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Accommodation Development",
    "rationale": "Young children often show mild accommodative lag due to immature feedback control mechanisms that improve with age.",
    "choices": [
      "Incomplete maturation of accommodative accuracy",
      "Pathologic accommodative spasm",
      "Fully developed accommodative facility",
      "Loss of convergence control"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "An infant's pupils constrict to light by 1 month of age. Which neural pathway mediates this response?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Pupillary Reflex",
    "rationale": "The parasympathetic pathway via the Edinger-Westphal nucleus and CN III mediates pupillary constriction to light.",
    "choices": [
      "Parasympathetic fibers from the Edinger-Westphal nucleus",
      "Sympathetic fibers from the superior cervical ganglion",
      "Magnocellular efferents from LGN",
      "Trigeminal sensory reflex"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 7-year-old's visual acuity measures 20/20 OU but reading fluency is delayed. Which developmental system is most likely involved?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Visual Perception",
    "rationale": "Reading relies on cortical processing of spatial and temporal visual information; deficits cause perceptual learning delays despite normal acuity.",
    "choices": [
      "Visual processing and perceptual integration",
      "Refractive accommodation",
      "Retinal summation",
      "Oculomotor fixation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 9-month-old has visual acuity of approximately 20/100 using Teller acuity cards. What does this suggest?",
    "discipline": "Anatomy",
    "condition": "Visual & Human Development",
    "sub": "Acuity Development",
    "rationale": "Grating acuity improves rapidly in infancy, reaching about 20/100 by 9 months and 20/20 by 3-5 years.",
    "choices": [
      "Normal development for age",
      "Delayed development",
      "Amblyopia",
      "Optic nerve hypoplasia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which nerve innervates the orbicularis oculi muscle responsible for eyelid closure?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Anatomy-Innervation",
    "rationale": "Orbicularis oculi is supplied by CN VII; levator is CN III; Müller's is sympathetic.",
    "choices": [
      "Facial nerve (CN VII)",
      "Oculomotor nerve (CN III)",
      "Trigeminal nerve (CN V)",
      "Sympathetic fibers via superior cervical ganglion"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with unilateral ptosis improves after instillation of apraclonidine. Which structure is most directly responsible for the drug-induced elevation?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Physiology-Sympathetic",
    "rationale": "Apraclonidine stimulates α-adrenergic receptors of Müller's muscle causing ~1-2 mm lid lift.",
    "choices": [
      "Müller's (superior tarsal) muscle",
      "Levator palpebrae superioris",
      "Orbicularis oculi",
      "Frontalis muscle"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which glands secrete the lipid layer of the tear film that reduces evaporation?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Physiology-Tear Film",
    "rationale": "Meibomian glands provide the bulk of the lipid layer; Zeis contributes to lash follicles but not the principal lipid layer.",
    "choices": [
      "Meibomian glands",
      "Krause glands",
      "Wolfring glands",
      "Zeis glands only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Order the normal tear drainage pathway from ocular surface to nasal cavity.",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Anatomy-Lacrimal Drainage",
    "rationale": "Physiologic flow is puncta → canaliculi (often join) → lacrimal sac → NLD → valve of Hasner into inferior meatus.",
    "choices": [
      "Puncta → canaliculi → common canaliculus → lacrimal sac → nasolacrimal duct → valve of Hasner",
      "Canaliculi → puncta → lacrimal sac → nasolacrimal duct → valve of Rosenmüller",
      "Puncta → nasolacrimal duct → lacrimal sac → common canaliculus → nose",
      "Caruncle → puncta → canaliculi → nasolacrimal duct → sac"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding most reliably differentiates preseptal cellulitis from orbital cellulitis on exam?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Disease-Cellulitis",
    "rationale": "Painful EOM restriction and/or proptosis implies post-septal (orbital) involvement requiring urgent imaging and IV antibiotics.",
    "choices": [
      "Painful limitation of extraocular movements and proptosis",
      "Eyelid erythema and edema",
      "History of sinus infection",
      "Low-grade fever alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A firm, non-tender eyelid mass persists for 6 weeks after an acute stye resolved. Best next step?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Treatment-Chalazion",
    "rationale": "Chalazion is a chronic lipogranuloma; initial conservative care, then steroid injection or incision/curettage if refractory.",
    "choices": [
      "Warm compresses and consider intralesional steroid or I&D if persistent",
      "Immediate broad-spectrum oral antibiotics",
      "CT orbit and urgent ENT consult",
      "Start high-potency topical steroid for 4 weeks without follow-up"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "An 8-week-old has tearing, crusting, and matting since birth; pressure over the lacrimal sac expresses mucus. Best initial management?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Disease-CNLDO",
    "rationale": "Congenital NLD obstruction is common; most resolve by 6-12 months with massage; treat superinfection as needed.",
    "choices": [
      "Crigler (sac) massage and lid hygiene; consider topical antibiotic if secondary conjunctivitis",
      "Immediate NLD probing in the OR",
      "Oral antibiotics for presumed dacryocystitis",
      "No treatment; this is normal"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 34-year-old with meibomian gland dysfunction has TBUT of 6 seconds (three trials). How is this interpreted quantitatively?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Physiology-TBUT",
    "rationale": "TBUT <10 seconds is typically abnormal and consistent with evaporative dry eye from MGD.",
    "choices": [
      "Abnormal tear film stability (likely evaporative DED)",
      "Normal stability",
      "Aqueous deficiency exclusively",
      "Measurement error-repeat only once"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Schirmer I (without anesthesia) after 5 minutes measures 4 mm OU. Best interpretation?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Physiology-Schirmer",
    "rationale": "Schirmer I ≤5 mm/5 min suggests aqueous-deficient dry eye; >10 mm is typically normal.",
    "choices": [
      "Aqueous tear deficiency",
      "Normal tearing",
      "Reflex tearing only",
      "Evaporative dry eye exclusively"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "During lacrimal irrigation via the lower punctum, saline exits the upper punctum immediately. Most likely interpretation?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Interpretation-Irrigation",
    "rationale": "Reflux through the opposite punctum indicates a blockage proximal to the sac, often at the common canaliculus.",
    "choices": [
      "Common canalicular obstruction",
      "Patent system into the nose",
      "Complete NLD obstruction only",
      "Completely normal test"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 57-year-old with long-standing blepharitis has lash misdirection abrading the cornea. Best terminology?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Disease-Lashes",
    "rationale": "Trichiasis is misdirected lashes from normal follicles; distichiasis is an accessory row; entropion is lid inversion.",
    "choices": [
      "Trichiasis",
      "Distichiasis",
      "Entropion",
      "Ectropion"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient has lower lid margin turned outward with epiphora and exposure symptoms. Most appropriate initial management?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Treatment-Ectropion",
    "rationale": "Ectropion causes punctal malposition and exposure; lubricants/taping help, but definitive care is surgical.",
    "choices": [
      "Lubrication and taping; oculoplastics referral for ectropion repair",
      "High-dose topical steroid alone",
      "Immediate dacryocystorhinostomy",
      "Oral antivirals"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 32-year-old with acute dacryoadenitis has tender superotemporal swelling and S-shaped ptosis. Most appropriate initial workup/therapy?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Disease-Lacrimal Gland",
    "rationale": "Lacrimal gland inflammation can be viral, bacterial, or autoimmune; targeted therapy depends on etiology.",
    "choices": [
      "Rule out infection vs inflammatory (mumps, EBV, bacterial); consider systemic antibiotics if bacterial suspected",
      "Immediate NLD probing",
      "High-dose IV steroids without labs",
      "Emergent canthotomy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 49-year-old with thyroid eye disease has lid retraction, proptosis, and limited upgaze. Which EOM is classically most involved?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Disease-TED",
    "rationale": "Inferior rectus is most commonly fibrosed, limiting elevation and producing vertical diplopia.",
    "choices": [
      "Inferior rectus",
      "Superior oblique",
      "Medial rectus only",
      "Lateral rectus"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Hertel exophthalmometry reads 23 mm OD and 19 mm OS (base 100). How is this best interpreted?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Quantitative-Exophthalmometry",
    "rationale": "Normal adult values are ~12-21 mm; >2 mm asymmetry is abnormal and suggests unilateral proptosis.",
    "choices": [
      "OD proptosis; interocular asymmetry >2 mm is abnormal",
      "Normal symmetry and magnitude",
      "Physiologic asymmetry only",
      "Both eyes are markedly enophthalmic"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which eyelid lesion mandates high suspicion for malignancy when presenting as a recurrent 'chalazion' with lash loss and ulceration?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Disease-Tumors",
    "rationale": "Sebaceous carcinoma often mimics chronic chalazia with madarosis and ulceration; biopsy is essential.",
    "choices": [
      "Sebaceous gland carcinoma",
      "Basal cell carcinoma only",
      "Actinic keratosis",
      "Papilloma"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient develops acute preseptal cellulitis from an external hordeolum. Appropriate first-line therapy?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Treatment-Infection",
    "rationale": "Uncomplicated preseptal cellulitis is treated with oral antibiotics and monitoring for orbital signs.",
    "choices": [
      "Oral antibiotics active against staphylococci/streptococci and close follow-up",
      "Topical antibiotic only",
      "Immediate IV broad-spectrum therapy for all cases",
      "Systemic steroids alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 70-year-old with heavy upper lids obstructing superior visual field has brow recruitment and dermatochalasis. What test supports functional blepharoplasty?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Management-Functional Surgery",
    "rationale": "Objective superior field improvement with taping supports medical necessity for blepharoplasty.",
    "choices": [
      "Taped vs untaped Humphrey or Goldmann perimetry showing superior field improvement",
      "Normal Schirmer",
      "Normal TBUT",
      "Normal Hertel values"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with canaliculitis has chronic epiphora and expression of yellow 'sulfur granules' from the punctum. Most likely organism?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Disease-Canaliculitis",
    "rationale": "Actinomyces causes canaliculitis with characteristic concretions ('sulfur granules'); treatment often requires curettage ± antibiotics.",
    "choices": [
      "Actinomyces israelii",
      "Pseudomonas aeruginosa",
      "Herpes simplex virus",
      "Candida albicans"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 62-year-old with chronic MGD presents with recurrent chalazia and rosacea. Which systemic medication best targets the pathophysiology?",
    "discipline": "Anatomy",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Treatment-MGD",
    "rationale": "Sub-antimicrobial doxycycline improves meibum quality and reduces inflammation in rosacea-associated MGD.",
    "choices": [
      "Low-dose oral doxycycline",
      "High-dose topical steroid",
      "Oral acyclovir",
      "Intramuscular penicillin G"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which lash-associated gland primarily produces a holocrine secretion at the follicle margin, contributing to the tear film lipid layer locally?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Lids / Lashes / Lacrimal / Adnexa / Orbit",
    "sub": "Anatomy-Glands",
    "rationale": "Zeis are sebaceous (holocrine) glands at lash follicles; Moll are apocrine sweat glands.",
    "choices": [
      "Zeis gland",
      "Moll gland",
      "Krause gland",
      "Wolfring gland"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which corneal layer provides the principal barrier to fluid entry from the tear film?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Corneal Anatomy",
    "rationale": "The epithelium has apical zonula occludens forming the main barrier to tear fluid; the endothelium is a leaky barrier with active pumps.",
    "choices": [
      "Corneal epithelium with tight junctions",
      "Stroma with collagen lamellae",
      "Descemet's membrane",
      "Endothelium with leaky junctions"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Limbal stem cells that regenerate corneal epithelium are concentrated at which anatomic site?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Limbal Physiology",
    "rationale": "Corneal epithelial stem cells reside at the limbus within the Palisades of Vogt and migrate centripetally.",
    "choices": [
      "Palisades of Vogt",
      "Caruncle",
      "Plica semilunaris",
      "Inferior fornix only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Bowman's layer injury heals primarily by which process?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Wound Healing",
    "rationale": "Bowman's is acellular and does not regenerate; defects fill with scar tissue from stromal keratocytes.",
    "choices": [
      "Fibrotic scarring without true regeneration",
      "Complete regeneration of original acellular matrix",
      "Proliferation of endothelial cells",
      "Migration of goblet cells into the cornea"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which statement best describes the corneal endothelium in adults?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Endothelial Physiology",
    "rationale": "Adult endothelial cells rarely divide; they spread to cover loss and actively pump fluid out to keep the cornea dehydrated.",
    "choices": [
      "Limited proliferative capacity; maintains deturgescence via pump-leak mechanism",
      "Rapid proliferation to replace lost cells",
      "Primary barrier to tears via tight junctions",
      "Producer of mucins for the glycocalyx"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which nerve supplies corneal sensation to the central cornea?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Innervation",
    "rationale": "Long ciliary nerves from the nasociliary branch of the ophthalmic division of CN V provide stromal and subbasal plexus innervation.",
    "choices": [
      "Nasociliary branch of V1 (long ciliary nerves)",
      "Maxillary division V2",
      "Facial nerve (CN VII)",
      "Greater petrosal nerve"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which tear film component is primarily produced by conjunctival goblet cells?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Tear Physiology",
    "rationale": "Conjunctival goblet cells secrete MUC5AC that stabilizes the aqueous layer and promotes wettability.",
    "choices": [
      "Gel-forming mucin (e.g., MUC5AC)",
      "Lipid layer",
      "Aqueous layer",
      "Electrolyte buffer only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 19-year-old contact lens wearer has a painful red eye with a large central ulcer and rapidly progressive stromal melt. Which organism is most classically implicated?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Bacterial Keratitis",
    "rationale": "Pseudomonas is strongly associated with soft lens wear and can cause fulminant keratitis with stromal necrosis.",
    "choices": [
      "Pseudomonas aeruginosa",
      "Herpes simplex virus",
      "Staphylococcus epidermidis",
      "Candida albicans"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which slit-lamp finding best distinguishes HSV epithelial keratitis from HZV keratitis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Viral Keratitis",
    "rationale": "HSV shows branching ulcers with terminal bulbs; HZV shows raised pseudodendrites without bulbs.",
    "choices": [
      "true dendrite with terminal bulbs and central ulceration",
      "Pseudodendrite without terminal bulbs",
      "Ring infiltrate",
      "Feathery borders with satellite lesions"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Acanthamoeba keratitis is MOST suggested by which combination?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Protozoal Keratitis",
    "rationale": "Severe pain out of proportion, ring infiltrate, and perineural infiltrates are classic; often contact lens related.",
    "choices": [
      "Disproportionate pain, ring infiltrate, perineural (radial) keratoneuritis",
      "Dendritic ulcer with bulbs",
      "Worsening on steroids but rapid response to antibiotics",
      "Mucopurulent discharge and papillae"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A filamentary keratitis picture in severe dry eye most directly reflects deficiency of which tear film function?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "DED Pathophysiology",
    "rationale": "Loss of mucin and aqueous leads to poor wettability and filament formation adherent to the epithelium.",
    "choices": [
      "Mucin/aqueous interface stability",
      "Lipid evaporation barrier",
      "Electrolyte buffering only",
      "Reflex tearing only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which conjunctival reaction pattern is most characteristic of allergic conjunctivitis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Allergy",
    "rationale": "Allergy classically produces papillae (vascular cores) on the tarsal conjunctiva; follicles are lymphoid hyperplasia seen in viral/chlamydial disease.",
    "choices": [
      "Papillae on tarsal conjunctiva",
      "Follicles on inferior palpebral conjunctiva",
      "Subconjunctival hemorrhage",
      "Concretions in the fornix"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A child with vernal keratoconjunctivitis most commonly shows which corneal complication?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "VKC",
    "rationale": "VKC can form superior plaque-like shield ulcers from giant papillae mechanical trauma and inflammation.",
    "choices": [
      "Shield ulcer on the superior cornea",
      "Peripheral ulcerative keratitis",
      "Interpalpebral band keratopathy",
      "Herpetic dendritic ulcer"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which degeneration typically presents as a superior peripheral, thinning arcuate lesion with against-the-rule astigmatism and intact epithelium?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Degenerations",
    "rationale": "Terrien's shows superior peripheral thinning with lipid deposition at the leading edge and ATR astigmatism.",
    "choices": [
      "Terrien marginal degeneration",
      "Salzmann nodular degeneration",
      "Pellucid marginal degeneration (inferior)",
      "Arcus senilis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which pairing of corneal dystrophy and layer is correct?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Dystrophies",
    "rationale": "Reis-Bücklers affects Bowman's. Meesmann is epithelial; Lattice and Granular are stromal; Fuchs is endothelial.",
    "choices": [
      "Reis-Bücklers - Bowman's layer",
      "Meesmann - stroma",
      "Macular - epithelium",
      "Lattice - endothelium"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Fuchs endothelial corneal dystrophy initially presents with which slit-lamp finding?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Fuchs",
    "rationale": "Endothelial dysfunction produces Descemet's guttae; later edema and bullae may develop.",
    "choices": [
      "Guttae on Descemet's membrane",
      "Subepithelial haze centrally",
      "Peripheral iron line",
      "Feathery stromal infiltrates"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Pterygium pathophysiology most closely involves which mechanism?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Pterygium",
    "rationale": "Chronic UV exposure causes elastotic degeneration and limbal stem cell changes with fibrovascular growth onto the cornea.",
    "choices": [
      "UV-induced elastotic degeneration and limbal stem cell dysfunction",
      "Autoimmune destruction of endothelium",
      "Herpetic infection of Bowman's layer",
      "Iron deposition from tears"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which is the most appropriate first-line therapy for moderate allergic conjunctivitis with itching?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Treatment-Allergy",
    "rationale": "Dual-action agents (e.g., olopatadine) provide rapid relief and prophylaxis; topical anesthetics are contraindicated for home use.",
    "choices": [
      "Topical dual-action antihistamine/mast-cell stabilizer",
      "Topical aminoglycoside q1h",
      "Oral corticosteroids",
      "Topical anesthetic PRN at home"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which topical therapy is MOST appropriate initial treatment for presumed bacterial keratitis pending culture results?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Treatment-Bacterial",
    "rationale": "Fourth-generation fluoroquinolone monotherapy is an accepted empiric choice for many community bacterial ulcers.",
    "choices": [
      "Broad-spectrum topical fluoroquinolone monotherapy",
      "Topical steroid alone",
      "Lubricants only",
      "Topical anesthetic q2h"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which clinical clue favors fungal keratitis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Fungal",
    "rationale": "Fungal ulcers often follow vegetable matter trauma and show feathery edges and satellite lesions.",
    "choices": [
      "Feathery borders with satellite lesions after vegetative trauma",
      "Rapid dendritic ulcer with bulbs",
      "Ring infiltrate with severe pain out of proportion",
      "Purulent hypopyon in a soft lens wearer within hours"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which of the following is a recognized contraindication to elective corneal refractive surgery?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Refractive-Screening",
    "rationale": "Pre-existing ectatic disease or high risk for ectasia is a major contraindication to corneal laser refractive surgery.",
    "choices": [
      "Keratoconus or corneal ectasia risk",
      "Stable mild myopia with thick cornea",
      "Dry eye treated with lubricants",
      "Age 30 with stable refraction 2 years"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which statement best differentiates LASIK from PRK?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Refractive-Procedures",
    "rationale": "LASIK uses a flap; PRK treats the surface with epithelial removal and can be preferred in thinner corneas.",
    "choices": [
      "LASIK involves flap creation; PRK removes epithelium without a flap",
      "PRK induces more dry eye than LASIK",
      "LASIK requires longer epithelial healing than PRK",
      "PRK is contraindicated in thin corneas"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Corneal cross-linking for progressive keratoconus strengthens the cornea by which mechanism?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Refractive-CXL",
    "rationale": "Riboflavin activation by UVA creates additional covalent bonds between collagen fibrils, increasing biomechanical rigidity.",
    "choices": [
      "Riboflavin/UVA-mediated collagen cross-bridging",
      "Increasing endothelial cell count",
      "Inducing stromal edema",
      "Replacing Bowman's layer with graft"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 27-year-old has unilateral scissoring reflex on retinoscopy, inferior steepening on topography, and Fleischer ring. Most likely diagnosis?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Keratoconus",
    "rationale": "Keratoconus hallmark features include scissoring, inferior steepening, and iron deposition (Fleischer ring).",
    "choices": [
      "Keratoconus",
      "Terrien degeneration",
      "Pellucid marginal degeneration",
      "Salzmann nodules"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which sign is most typical of conjunctival chlamydial infection (adult inclusion conjunctivitis)?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Chlamydia",
    "rationale": "Chlamydia produces follicles and preauricular lymphadenopathy; it may be chronic and unilateral or bilateral asymmetric.",
    "choices": [
      "Follicular response with palpable preauricular node",
      "Giant papillae on upper tarsus only",
      "Membranous pseudomembranes with diphtheria",
      "Dendrites with terminal bulbs"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Trachoma may leave which pathognomonic sequelae?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Trachoma",
    "rationale": "Herbert pits (limbal depressions) result from resolved follicles in trachoma; scarring can cause entropion/trichiasis.",
    "choices": [
      "Herbert pits at the limbus",
      "Kayser-Fleischer ring",
      "Hudson-Stähli line",
      "Arlt line of pigment on endothelium"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which statement about corneal transparency is MOST accurate?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Optical Properties",
    "rationale": "Short-range regular collagen spacing and controlled hydration by endothelial pumps are essential for corneal clarity.",
    "choices": [
      "Regular collagen spacing and stromal dehydration minimize light scatter",
      "High water content maximizes transparency",
      "Irregular fibril spacing improves refraction",
      "Myofibroblast activation decreases haze"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 30-year-old with recurrent corneal erosions after minor trauma most likely has which underlying epithelial condition?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "RCE",
    "rationale": "EBMD (map-dot-fingerprint) predisposes to poor hemidesmosomal adhesion and recurrent erosions.",
    "choices": [
      "Epithelial basement membrane dystrophy",
      "Fuchs endothelial dystrophy",
      "Meesmann epithelial dystrophy only",
      "Reis-Bücklers dystrophy exclusively"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which sign best indicates OSSN (ocular surface squamous neoplasia) at the limbus?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Tumors",
    "rationale": "OSSN often appears gelatinous or leukoplakic with feeder vessels, commonly at the interpalpebral limbus (UV-related).",
    "choices": [
      "Leukoplakic, feeder-vessel lesion with gelatinous appearance",
      "Grey-blue ring at corneal periphery",
      "Golden-brown iron line at the base of a cone",
      "Confluent superior pannus with Arlt line"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which topical agent is CONTRAINDICATED in active epithelial HSV keratitis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "HSV Treatment",
    "rationale": "Topical steroids may worsen active epithelial HSV; they are used cautiously for stromal disease with antiviral cover.",
    "choices": [
      "Topical corticosteroid without antiviral coverage",
      "Topical trifluridine",
      "Oral acyclovir",
      "Topical ganciclovir gel"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which corneal finding is most typical of Salzmann nodular degeneration?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Degenerations",
    "rationale": "Salzmann presents as bluish subepithelial nodules, often post-inflammatory (e.g., chronic keratitis).",
    "choices": [
      "Blue-white elevated subepithelial nodules often in chronically inflamed eyes",
      "Peripheral superior thinning with lipid",
      "Central map-dot changes",
      "Gelatinous limbal lesion with feeder vessels"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which pattern is MOST consistent with dry eye disease on testing?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "DED Testing",
    "rationale": "Short TBUT with adequate Schirmer points to evaporative DED (e.g., MGD); low Schirmer indicates aqueous deficiency.",
    "choices": [
      "TBUT < 10 s with normal Schirmer suggests evaporative DED",
      "Schirmer < 5 mm and TBUT > 15 s suggests evaporative DED",
      "Normal TBUT and Schirmer < 5 mm indicates mucin deficiency only",
      "Elevated tear osmolarity rules out DED"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which is the most appropriate initial approach to recurrent marginal keratitis associated with staphylococcal blepharitis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Inflammatory Keratitis",
    "rationale": "Staph hypersensitivity at the limbus responds to blepharitis control with short anti-inflammatory/antibiotic therapy.",
    "choices": [
      "Lid hygiene, warm compresses, topical antibiotic/steroid combo short course",
      "Topical antiviral therapy",
      "Systemic antifungal therapy",
      "Observation only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 22-year-old has photophobia and multiple coarse punctate epithelial lesions after UV exposure (welding arc). Diagnosis?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Photokeratitis",
    "rationale": "UV injury causes diffuse PEK and severe photophobia after latent period; typically heals within 24-72 hours.",
    "choices": [
      "UV keratitis (photokeratitis)",
      "Herpetic epithelial keratitis",
      "Adenoviral keratoconjunctivitis",
      "Acanthamoeba keratitis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which conjunctival structure has the highest density of goblet cells?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Anatomy-Goblet Cells",
    "rationale": "Goblet cells cluster in the inferonasal fornix and caruncle, contributing to mucin layer production.",
    "choices": [
      "Inferonasal bulbar/fornical conjunctiva and caruncle",
      "Temporal bulbar conjunctiva",
      "Upper tarsal conjunctiva",
      "Limbus only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 35-year-old is screened for LASIK. Pachymetry is 520 μm. Planned flap is 110 μm; ablation is estimated at 12 μm per diopter for −4.00 D. What is the approximate residual stromal bed (ignore epithelial thickness)?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Refractive-Calculations",
    "rationale": "RSB ≈ 520 − 110 − (12×4) = 362 μm; a common safety target is ≥250-300 μm depending on guidelines.",
    "choices": [
      "520 − 110 − 48 ≈ 362 μm",
      "520 − 110 − 48 ≈ 282 μm",
      "520 − 110 − 12 ≈ 398 μm",
      "520 − 90 − 60 ≈ 370 μm"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which iron deposition line is classically associated with keratoconus at the base of the cone?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Iron Lines",
    "rationale": "Fleischer ring is an iron line encircling the cone in keratoconus; Stocker is ahead of a pterygium; Hudson-Stähli is interpalpebral.",
    "choices": [
      "Fleischer ring",
      "Hudson-Stähli line",
      "Stocker line",
      "Kayser-Fleischer ring"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 64-year-old with corneal edema and bullae after cataract surgery most likely has which mechanism of vision loss?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Endothelial Failure",
    "rationale": "Endothelial cell loss causes pump failure, stromal edema, and epithelial bullae-pseudophakic bullous keratopathy.",
    "choices": [
      "Pseudophakic bullous keratopathy from endothelial decompensation",
      "Autoimmune epithelial attack",
      "Acute angle-closure glaucoma only",
      "Mucin deficiency"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which topical agent best addresses neurotrophic keratopathy stage 1-2 after optimizing lubrication?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Neurotrophic",
    "rationale": "Cenegermin promotes corneal nerve and epithelial healing; anesthetics are contraindicated for home use.",
    "choices": [
      "Cenegermin (recombinant NGF)",
      "High-dose topical steroid",
      "Topical anesthetic PRN",
      "Only hypertonic saline"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding best separates preseptal from orbital cellulitis when evaluating a red, swollen eye?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Differential",
    "rationale": "EOM pain/limitation and proptosis indicate post-septal spread; requires urgent imaging and IV antibiotics.",
    "choices": [
      "Painful EOM restriction and/or proptosis indicates orbital cellulitis",
      "Lid edema alone indicates orbital involvement",
      "Conjunctival injection alone indicates orbit",
      "Fever is required for orbital disease"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Stocker's line is an iron deposition line associated with which lesion?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Iron Lines",
    "rationale": "Stocker's line lies anterior to the advancing edge of a pterygium.",
    "choices": [
      "Advancing head of a pterygium",
      "Keratoconus cone base",
      "Interpalpebral exposure zone",
      "Wilson disease copper deposition"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which organism is most associated with post-traumatic fungal keratitis following agricultural injury?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Fungal",
    "rationale": "Filamentous fungi such as Fusarium are common after vegetative trauma.",
    "choices": [
      "Fusarium species",
      "Pseudomonas",
      "Acanthamoeba",
      "Moraxella catarrhalis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which is the BEST initial management for epithelial basement membrane dystrophy presenting with recurrent erosions?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "RCE Treatment",
    "rationale": "Hypertonic agents reduce epithelial edema; bandage CL can promote adherence; refractory cases may need debridement/PTK.",
    "choices": [
      "Hypertonic ointment at bedtime and lubricants; consider bandage CL",
      "Topical steroid hourly for one week",
      "Oral antivirals for 14 days",
      "Nocturnal patching only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which stromal dystrophy is characterized by amyloid deposition with branching lines?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Dystrophies",
    "rationale": "Lattice is due to amyloid deposition forming refractile branching lines; granular is hyaline; macular is GAGs.",
    "choices": [
      "Lattice dystrophy",
      "Granular dystrophy",
      "Macular dystrophy",
      "Meesmann dystrophy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which of the following MOST increases risk of post-LASIK ectasia?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Refractive-Risk",
    "rationale": "Low RSB and abnormal topography (forme fruste keratoconus) are major ectasia risk factors.",
    "choices": [
      "Thin residual stromal bed and suspicious topography",
      "Older age with thick cornea",
      "Low myopic correction with PRK",
      "Treating low hyperopia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which is the most appropriate first-line therapy for mild pingueculitis without ulceration?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Pinguecula",
    "rationale": "Conservative care with surface lubrication and UV control is typical; surgery is for cosmesis or recurrent pterygium-like growth.",
    "choices": [
      "Lubricants and UV protection; short course of topical NSAID/steroid if symptomatic",
      "Topical antiviral",
      "Oral antifungal",
      "Immediate surgical excision"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which metric most directly reflects endothelial functional reserve on specular microscopy?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Endothelium",
    "rationale": "Cell density and morphology (polymegathism, pleomorphism) reflect pump reserve; low counts risk decompensation.",
    "choices": [
      "Endothelial cell density (cells/mm²)",
      "Central corneal thickness alone",
      "Best-corrected visual acuity",
      "Keratometry values"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which is TRUE regarding LASIK vs PRK postoperative corneal nerves and dry eye?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Refractive-Nerves",
    "rationale": "LASIK flap creation disrupts more subbasal nerves acutely than PRK; sensation recovers over months.",
    "choices": [
      "LASIK transects more subbasal nerves initially, often causing greater early dry eye than PRK",
      "PRK causes more persistent nerve loss than LASIK",
      "Neither affects corneal sensation",
      "Dry eye is unrelated to corneal innervation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which combination best matches VKC management during a seasonal flare?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "VKC Treatment",
    "rationale": "Control inflammation and allergic response; treat corneal complications like shield ulcers appropriately.",
    "choices": [
      "Dual-acting antihistamine/mast-cell stabilizer ± short steroid pulse; treat shield ulcers if present",
      "Topical antibiotic q1h",
      "Oral acyclovir",
      "Only artificial tears"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which description best explains the pathogenesis of band keratopathy?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Band Keratopathy",
    "rationale": "Band keratopathy is calcific deposition in Bowman's/anterior stroma interpalpebrally; chelation may be used.",
    "choices": [
      "Calcium deposition in Bowman's layer and anterior stroma at the interpalpebral zone",
      "Iron deposition at cone base",
      "Amyloid deposition in mid-stroma",
      "GAG accumulation throughout stroma"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In a patient with severe aqueous-deficient dry eye from Sjögren syndrome, which step is appropriate after controlling surface inflammation?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "DED Management",
    "rationale": "Punctal occlusion can be beneficial once inflammation is addressed; avoid anesthetic abuse.",
    "choices": [
      "Punctal occlusion",
      "Topical anesthetics for comfort at home",
      "Only hypertonic saline",
      "Empiric antivirals long-term"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which layer primarily determines corneal tensile strength?",
    "discipline": "Anatomy",
    "condition": "Conjunctiva / Cornea / Refractive Surgery",
    "sub": "Biomechanics",
    "rationale": "The stromal collagen lamellae provide most biomechanical strength; excessive stromal removal risks ectasia.",
    "choices": [
      "Stroma (collagen lamellae)",
      "Epithelium",
      "Descemet's membrane",
      "Endothelium"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which cataract type most commonly causes disproportionate glare disability and decreased near vision in younger patients?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Cataract-Phenotype",
    "rationale": "PSC scatters light at the nodal point and is highly symptomatic for glare and near vision, often in younger patients or steroid users.",
    "choices": [
      "Posterior subcapsular cataract (PSC)",
      "Nuclear sclerotic cataract",
      "Cortical spoke cataract",
      "Anterior polar cataract"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A hyperopic shift is most classically associated with which lens change?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Refractive Effects",
    "rationale": "Early cortical changes can cause a hyperopic shift via lens swelling; nuclear sclerosis more often causes a myopic shift.",
    "choices": [
      "Cortical hydration causing shallow anterior chamber",
      "Nuclear sclerosis increasing lens index and thickness",
      "Posterior capsule fibrosis after YAG",
      "Anterior capsule phimosis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which preoperative factor is MOST important to hold prior to keratometry/biometry to avoid erroneous corneal power?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Preop-Biometry",
    "rationale": "Contact lenses alter corneal shape/tear film; discontinuation reduces keratometry error prior to IOL calculations.",
    "choices": [
      "Discontinue soft contact lenses (≥1 week) before measurements",
      "Avoid caffeine for 24 hours",
      "Stop artificial tears for 48 hours",
      "Stop antihistamines for 72 hours"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient scheduled for cataract surgery has a shallow anterior chamber, very short axial length, and narrow angles. Which postoperative complication is relatively more likely without careful planning?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Anatomy/Physiology-Short Eyes",
    "rationale": "Short axial length eyes with shallow ACs are at higher risk of aqueous misdirection postoperatively.",
    "choices": [
      "Malignant glaucoma (aqueous misdirection)",
      "Rhegmatogenous retinal detachment",
      "Cystoid macular edema",
      "Toxic anterior segment syndrome"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 72-year-old on tamsulosin presents for phacoemulsification. Which intraoperative issue is most characteristic and should be anticipated?",
    "discipline": "Pharmacology",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Pharmacology-IFIS",
    "rationale": "α1A antagonists (e.g., tamsulosin) are associated with IFIS; plan use of iris hooks/expanders and low-flow settings.",
    "choices": [
      "Intraoperative floppy iris syndrome with billowing iris and progressive miosis",
      "Posterior polar cataract with pre-existing posterior capsular defect",
      "Zonulopathy from pseudoexfoliation only",
      "Toxic anterior segment syndrome"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Posterior capsular opacification (PCO) after cataract surgery most directly reflects proliferation/transdifferentiation of which cells?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Pathophysiology-PCO",
    "rationale": "Residual lens epithelial cells proliferate and migrate (Elschnig pearls/fibrosis), reducing visual clarity until YAG capsulotomy.",
    "choices": [
      "Residual lens epithelial cells on the capsule",
      "Corneal endothelial cells migrating onto IOL",
      "Ciliary body epithelium",
      "Vitreous hyalocytes"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with pseudoexfoliation syndrome is scheduled for cataract surgery. Which primary anatomic concern should inform the surgical plan?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Anatomy-Zonules",
    "rationale": "Pseudoexfoliation weakens zonules; CTRs and gentle hydrodissection reduce capsular instability risk.",
    "choices": [
      "Zonular weakness requiring possible capsular tension ring",
      "Thick posterior capsule risk",
      "High risk of retinal dialysis",
      "Increased risk of IFIS from α1 blockade"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which postoperative timing is MOST typical for Irvine-Gass cystoid macular edema (CME) after uncomplicated cataract surgery?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Postop-CME",
    "rationale": "Pseudophakic CME commonly presents within several weeks and is managed with topical NSAID ± steroid; OCT confirms diagnosis.",
    "choices": [
      "4-8 weeks post-op",
      "24-48 hours post-op",
      "6-12 months post-op only",
      "Immediately intraoperative"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A long axial length myope (−10.00 D) desires minimal spectacle dependence at distance. Which IOL strategy best addresses optical goals and retinal risk?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Preop Planning-Long Eyes",
    "rationale": "Long myopic eyes benefit from formulas optimized for long AL; slight myopic target is acceptable, and attention to higher RD risk is prudent.",
    "choices": [
      "Target slight myopia (e.g., −0.25 to −0.50 D) with monofocal IOL and careful peripheral retinal exam pre/post-op",
      "Target +0.50 D hyperopia with multifocal IOL",
      "Place a piggyback high-plus IOL",
      "Avoid biometry adjustment because long eyes are predictable"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which tissue layer lies immediately superficial to sclera and contains radial vessels that blanch with 2.5% phenylephrine?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Anatomy-Episclera",
    "rationale": "Episcleral vessels are superficial to the dense, avascular sclera and typically blanch with topical vasoconstrictors.",
    "choices": [
      "Episclera",
      "Tenon's capsule",
      "Conjunctival substantia propria",
      "Suprachoroid"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "The sclera derives its opaque appearance primarily from which property?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Physiology-Optical",
    "rationale": "Unlike the cornea, scleral collagen has irregular spacing and orientation, increasing scatter and causing opacity.",
    "choices": [
      "Irregular collagen fiber arrangement and variable hydration",
      "High melanin content",
      "Tight epithelial junctions",
      "Uniform lamellar spacing as in cornea"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding most strongly favors scleritis over episcleritis?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Disease-Differential",
    "rationale": "Scleritis causes deep, severe pain and tenderness of extraocular muscles; episcleritis is usually milder and blanches.",
    "choices": [
      "Severe, boring eye pain radiating to temple/jaw and pain with eye movement",
      "Sectoral redness with minimal tenderness",
      "Blanching with phenylephrine",
      "Self-limited course without systemic association"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic disease is classically associated with necrotizing anterior scleritis and scleromalacia perforans?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Pathophysiology-Systemic",
    "rationale": "RA-associated vasculitis can produce necrotizing scleritis including scleromalacia perforans (painless thinning).",
    "choices": [
      "Rheumatoid arthritis",
      "Multiple sclerosis",
      "Type 2 diabetes",
      "Parkinson disease"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Blue sclera is most often due to thinning of which layer allowing underlying uveal pigment to show through?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Anatomy-Sclera",
    "rationale": "Thinned scleral stroma (e.g., in osteogenesis imperfecta) reveals the dark uvea, giving a blue hue.",
    "choices": [
      "Scleral stroma",
      "Episclera",
      "Conjunctival epithelium",
      "Descemet's membrane"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which cell type predominates in granulomatous anterior uveitis, producing mutton-fat keratic precipitates?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Pathophysiology-Granulomatous",
    "rationale": "Granulomatous AU features large greasy KPs composed of macrophages/epithelioid cells (e.g., sarcoid, TB).",
    "choices": [
      "Epithelioid histiocytes and macrophages",
      "Neutrophils only",
      "Eosinophils",
      "Mast cells"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which feature best distinguishes nongranulomatous from granulomatous anterior uveitis?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Disease-Phenotypes",
    "rationale": "Nongranulomatous AU often presents acutely with pain/photophobia and small, fine KPs (e.g., HLA-B27).",
    "choices": [
      "Fine stellate KPs and acute onset pain/photophobia",
      "Mutton-fat KPs and iris nodules",
      "Busacca/Koeppe nodules",
      "Vitritis predominance"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In HLA-B27-associated anterior uveitis, which clinical pattern is most typical?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Disease-HLA-B27",
    "rationale": "HLA-B27 AU is classically acute, nongranulomatous, often unilateral and recurrent, sometimes with fibrin/hypopyon.",
    "choices": [
      "Acute, unilateral, recurrent nongranulomatous iridocyclitis with fibrin and hypopyon possible",
      "Chronic, bilateral granulomatous uveitis with iris nodules",
      "Insidious bilateral intermediate uveitis only",
      "Posterior uveitis with choroidal granulomas"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Posterior synechiae form between which structures in anterior uveitis?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Anatomy-Synechiae",
    "rationale": "Inflammatory fibrin and pigment can cause the iris to stick to the anterior lens capsule, creating posterior synechiae.",
    "choices": [
      "Iris posterior surface and anterior lens capsule",
      "Iris root and ciliary body",
      "Corneal endothelium and iris",
      "Lens and corneal endothelium"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Iris bombe with secondary angle-closure most directly results from which event in uveitis?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Pathophysiology-Angle Closure",
    "rationale": "Seclusion pupillae (ring synechiae) prevents aqueous from moving to the anterior chamber, bowing the iris forward.",
    "choices": [
      "360° posterior synechiae blocking pupillary flow",
      "Peripheral anterior synechiae only",
      "Trabecular meshwork hypoplasia",
      "Lens subluxation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which is the FIRST-line topical therapy for acute anterior uveitis to control pain and prevent synechiae?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Treatment-AAU",
    "rationale": "Cycloplegics relieve ciliary spasm and reduce synechiae; steroids control intraocular inflammation.",
    "choices": [
      "Cycloplegic/mydriatic (e.g., homatropine) plus topical corticosteroid",
      "Topical beta-blocker only",
      "Topical antibiotic",
      "Hypertonic saline"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Fuchs heterochromic iridocyclitis is characterized by which classic constellation?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Disease-Fuchs",
    "rationale": "Fuchs is chronic, mild, often unilateral with diffuse stellate KPs and iris stromal atrophy; cataract and glaucoma are common.",
    "choices": [
      "Low-grade unilateral AU, stellate KPs, iris atrophy, cataract, and angle neovascularization risk (Amsler sign)",
      "Severe pain with hypopyon",
      "Bilateral granulomatous uveitis with sarcoid nodes",
      "Alternating AU with back pain in HLA-B27"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Juvenile idiopathic arthritis is most associated with what pattern of anterior uveitis?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Disease-JIA",
    "rationale": "JIA AU is frequently asymptomatic but chronic, risking complications; regular screening is critical.",
    "choices": [
      "Chronic, often bilateral, quiet AU with risk of band keratopathy and cataract",
      "Acute painful unilateral AU with hypopyon",
      "Intermediate uveitis only",
      "Posterior choroiditis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which muscle fibers mediate pupillary constriction and are activated during the near triad?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Physiology-Iris",
    "rationale": "The iris sphincter receives parasympathetic input through EW nucleus → ciliary ganglion → short ciliary nerves.",
    "choices": [
      "Iris sphincter via parasympathetic fibers (CN III-Edinger-Westphal)",
      "Iris dilator via sympathetic fibers",
      "Ciliary muscle via sympathetic fibers",
      "Levator via sympathetic fibers"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Aqueous humor formation is primarily driven by which process in the ciliary epithelium?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Physiology-Ciliary Body",
    "rationale": "Active secretion by the NPE/PE ciliary epithelium (CA-dependent) is the dominant mechanism for aqueous production.",
    "choices": [
      "Active secretion (carbonic anhydrase-dependent) with secondary ultrafiltration and diffusion",
      "Simple diffusion only",
      "Pinocytosis exclusively",
      "Transudation from iris stroma alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which sign suggests diffuse anterior scleritis rather than episcleritis during the phenylephrine blanching test?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Exam-Blanching",
    "rationale": "Deep scleral vessels are not affected by topical vasoconstrictors; color remains violaceous and tender.",
    "choices": [
      "Deep violaceous hue that does not blanch with phenylephrine",
      "Rapid blanching of involved vessels",
      "Sectoral redness only",
      "No tenderness on palpation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In acute anterior uveitis, IOP may be low initially. Which mechanism explains the hypotony?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Physiology-IOP",
    "rationale": "Ciliary body shutdown can decrease aqueous secretion, leading to transient hypotony; later IOP may rise from trabeculitis/synechiae.",
    "choices": [
      "Reduced aqueous production from ciliary body inflammation",
      "Enhanced outflow through trabecular meshwork",
      "Increased EVP only",
      "Leakage through corneal epithelium"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which is the most appropriate initial systemic work-up for recurrent granulomatous anterior uveitis without obvious cause?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Work-up",
    "rationale": "Granulomatous AU raises suspicion for sarcoid/TB; targeted systemic evaluation is appropriate with history-based tailoring.",
    "choices": [
      "Chest imaging and serum ACE/lysozyme for sarcoid ± TB testing based on risk",
      "Immediate HLA-B27 typing only",
      "Brain MRI in all cases",
      "ANA only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which treatment is contraindicated as monotherapy in active infectious anterior uveitis?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Treatment-Caution",
    "rationale": "Steroids alone can worsen infectious uveitis; they must be paired with appropriate antimicrobial therapy when infection is present.",
    "choices": [
      "Topical corticosteroid without antimicrobial coverage",
      "Cycloplegic agent",
      "Topical antibiotic when bacterial etiology suspected",
      "Antitubercular therapy in confirmed TB"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which scleral complication follows long-standing inflammation and presents as painless, extreme thinning with visible uveal tissue and minimal inflammation?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Disease-Sclera",
    "rationale": "Scleromalacia perforans is a necrotizing process without overt inflammation, often associated with RA.",
    "choices": [
      "Scleromalacia perforans",
      "Diffuse anterior scleritis",
      "Episcleritis",
      "Posterior scleritis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which imaging modality best confirms posterior scleritis when B-scan shows thickened posterior coats and a 'T-sign'?",
    "discipline": "Anatomy",
    "condition": "Episclera / Sclera / Anterior Uvea",
    "sub": "Diagnosis-Posterior Scleritis",
    "rationale": "Posterior scleritis shows sub-Tenon fluid (T-sign) on B-scan; MRI can assess scleral thickening/edema if needed.",
    "choices": [
      "Enhanced depth imaging OCT or orbital ultrasound corroboration; consider MRI to assess posterior coats",
      "Specular microscopy",
      "Fluorescein angiography only",
      "Pentacam tomography alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which component of the vitreous is primarily responsible for maintaining its gel-like consistency?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Vitreous Physiology",
    "rationale": "Hyaluronic acid binds water and maintains the spacing of collagen fibrils, giving the vitreous its viscoelastic gel structure.",
    "choices": [
      "Hyaluronic acid within the collagen fibril network",
      "Albumin within the aqueous phase",
      "Sodium chloride gradient",
      "Phospholipid micelles"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "At what retinal location is the internal limiting membrane (ILM) thickest?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Retinal Anatomy",
    "rationale": "The ILM is thickest at the posterior pole, particularly around the optic disc and macula, and thins toward the periphery.",
    "choices": [
      "Near the optic disc and macula",
      "At the equator",
      "At the ora serrata",
      "Evenly throughout the retina"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which retinal layer contains the photoreceptor cell bodies?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Retinal Layers",
    "rationale": "The outer nuclear layer houses photoreceptor cell bodies; the outer plexiform layer contains synapses with bipolar cells.",
    "choices": [
      "Outer nuclear layer",
      "Inner nuclear layer",
      "Outer plexiform layer",
      "Ganglion cell layer"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which structure provides the primary metabolic and waste exchange for photoreceptors?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "RPE Physiology",
    "rationale": "The RPE phagocytoses photoreceptor outer segments and mediates nutrient exchange between photoreceptors and the choroid.",
    "choices": [
      "Retinal pigment epithelium (RPE)",
      "Choriocapillaris only",
      "Vitreous humor",
      "Inner retinal capillaries"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "The choriocapillaris primarily nourishes which retinal layers?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Choroidal Circulation",
    "rationale": "The choriocapillaris supplies oxygen and nutrients to the outer retina and RPE, while inner layers are supplied by central retinal vessels.",
    "choices": [
      "Outer retina including photoreceptors and RPE",
      "Inner nuclear and ganglion layers",
      "Vitreous base",
      "Entire retina uniformly"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which retinal cell type is the first to fire an action potential rather than a graded potential?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Neurophysiology",
    "rationale": "All retinal neurons except ganglion cells produce graded potentials; ganglion cells generate action potentials transmitted via CN II.",
    "choices": [
      "Ganglion cell",
      "Photoreceptor",
      "Bipolar cell",
      "Horizontal cell"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which vitamin is most critical for regeneration of rhodopsin in rod photoreceptors?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Photochemistry",
    "rationale": "Vitamin A is converted to 11-cis-retinal, which recombines with opsin to regenerate rhodopsin after bleaching.",
    "choices": [
      "Vitamin A (retinol)",
      "Vitamin B2 (riboflavin)",
      "Vitamin E",
      "Vitamin K"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which pigment within the RPE absorbs scattered blue light and protects against oxidative damage?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "RPE Protection",
    "rationale": "Melanin within RPE melanosomes absorbs short-wavelength light, protecting photoreceptors from photo-oxidative stress.",
    "choices": [
      "Melanin",
      "Hemoglobin",
      "Xanthophyll",
      "Lipofuscin"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient reports new flashes and floaters. Which immediate diagnostic test is most critical?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Retinal Detachment-Evaluation",
    "rationale": "New flashes and floaters raise concern for retinal tear; a thorough dilated peripheral exam is essential to rule out breaks.",
    "choices": [
      "Dilated peripheral retinal exam with scleral depression",
      "OCT of macula only",
      "Visual field screening",
      "Fluorescein angiography"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which retinal finding most strongly suggests central retinal artery occlusion (CRAO)?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Vascular-Arterial",
    "rationale": "CRAO causes inner retinal ischemia leading to whitening with preserved foveal color from underlying choroidal circulation.",
    "choices": [
      "Pale retina with cherry-red fovea",
      "Flame hemorrhages and cotton wool spots",
      "Venous tortuosity with extensive hemorrhage",
      "Subretinal fluid and lipid exudates"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which mechanism underlies diabetic macular edema?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Vascular-Diabetic",
    "rationale": "Leakage from incompetent retinal capillaries disrupts the inner BRB, causing intraretinal fluid accumulation at the macula.",
    "choices": [
      "Breakdown of inner blood-retinal barrier from capillary leakage",
      "Photoreceptor apoptosis from vitamin A loss",
      "RPE detachment due to choroidal neovascularization",
      "Blockage of uveoscleral outflow"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which of the following best describes Bruch's membrane?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Anatomy-Bruch's",
    "rationale": "Bruch's membrane consists of five layers between RPE and choroid and thickens with age, impairing diffusion.",
    "choices": [
      "Five-layered barrier between RPE and choriocapillaris",
      "Single-cell RPE basement membrane",
      "Elastic lamina of sclera",
      "Inner limiting membrane of retina"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which inherited macular dystrophy is associated with abnormal accumulation of lipofuscin within the RPE?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Inherited Retinal Disease",
    "rationale": "Stargardt results from ABCA4 gene defects leading to toxic lipofuscin accumulation in RPE and photoreceptor loss.",
    "choices": [
      "Stargardt disease",
      "Best vitelliform dystrophy",
      "Cone dystrophy",
      "Retinitis pigmentosa"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which structure provides the majority of the retinal oxygen supply under normal conditions?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Choroidal Perfusion",
    "rationale": "The choroidal circulation supplies the highly metabolically active outer retina and photoreceptors.",
    "choices": [
      "Choroid via choriocapillaris",
      "Retinal arteries alone",
      "Vitreous diffusion",
      "Ciliary body vessels"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which sign most characterizes age-related macular degeneration with choroidal neovascularization?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Neovascular AMD",
    "rationale": "Wet AMD features choroidal neovascular membranes breaching Bruch's membrane, causing subretinal fluid/bleeding.",
    "choices": [
      "Subretinal fluid or hemorrhage beneath the RPE or neurosensory retina",
      "Cotton-wool spots around the arcades",
      "Venous beading and microaneurysms",
      "Silver-wiring of arterioles"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which retinal condition is most associated with the 'tobacco dust' sign (Shafer's sign) in the anterior vitreous?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Retinal Detachment",
    "rationale": "Pigment granules in the anterior vitreous (Shafer's sign) indicate RPE cells released from a retinal break.",
    "choices": [
      "Retinal tear or detachment",
      "Vitreous syneresis only",
      "Macular hole",
      "Optic disc drusen"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which retinal layer is first affected in retinitis pigmentosa, leading to the characteristic night blindness?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Retinitis Pigmentosa",
    "rationale": "Rod photoreceptors degenerate first in RP, causing nyctalopia and peripheral visual field loss before cone involvement.",
    "choices": [
      "Photoreceptor outer segments of rod cells",
      "Inner nuclear layer",
      "Ganglion cell layer",
      "RPE basal lamina"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which vascular network supplies the prelaminar portion of the optic nerve head?",
    "discipline": "Anatomy",
    "condition": "Vitreous / Retina / Choroid",
    "sub": "Optic Disc Circulation",
    "rationale": "The prelaminar and laminar optic nerve head receive blood from branches of the short posterior ciliary arteries forming the circle of Zinn-Haller.",
    "choices": [
      "Branches of the short posterior ciliary arteries forming the circle of Zinn-Haller",
      "Central retinal artery capillaries",
      "Vortex veins",
      "Anterior ciliary arteries alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which retinal ganglion cell axons form the papillomacular bundle?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Optic Nerve Anatomy",
    "rationale": "The papillomacular bundle contains macular fibers that enter the temporal disc and are critical for central vision.",
    "choices": [
      "Macular fibers entering the temporal side of the optic disc",
      "Nasal fibers crossing the horizontal raphe",
      "Peripheral nasal fibers entering nasally",
      "Superior arcuate fibers entering superiorly"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "The optic nerve sheath is continuous with which meningeal layers?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Anatomy-Meninges",
    "rationale": "The optic nerve is surrounded by all three meningeal layers, allowing intracranial pressure changes to affect the optic disc.",
    "choices": [
      "Dura, arachnoid, and pia mater",
      "Epidural membrane only",
      "Choroid and sclera",
      "Retinal pigment epithelium and Bruch's membrane"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which portion of the optic nerve is most vulnerable to ischemia in anterior ischemic optic neuropathy (AION)?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "AION",
    "rationale": "The prelaminar/laminar region supplied by the posterior ciliary arteries is most affected in AION, leading to disc edema.",
    "choices": [
      "Lamina cribrosa and prelaminar region",
      "Intraorbital segment",
      "Intracanalicular segment",
      "Intracranial segment"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "The horizontal raphe in the retina corresponds anatomically to which visual field demarcation?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Retinal-Visual Field Mapping",
    "rationale": "The horizontal raphe separates superior and inferior retinal fibers, corresponding to the horizontal visual meridian.",
    "choices": [
      "Horizontal meridian",
      "Vertical meridian",
      "Blind spot boundary",
      "Nasal step"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "The nasal retinal fibers responsible for temporal visual field perception cross at which structure?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Pathway Anatomy",
    "rationale": "Nasal fibers decussate at the optic chiasm, resulting in contralateral temporal field representation.",
    "choices": [
      "Optic chiasm",
      "Optic tract",
      "Lateral geniculate nucleus",
      "Optic radiation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A lesion at the right optic tract produces which visual field defect?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Field Defects",
    "rationale": "A right optic tract lesion affects right nasal and left temporal fibers, resulting in a left homonymous hemianopia.",
    "choices": [
      "Left homonymous hemianopia",
      "Right homonymous hemianopia",
      "Bitemporal hemianopia",
      "Binasal hemianopia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "The lateral geniculate nucleus (LGN) is located in which part of the brain?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "LGN Anatomy",
    "rationale": "The LGN lies in the posterior thalamus and serves as the relay between optic tract and optic radiations.",
    "choices": [
      "Thalamus",
      "Midbrain",
      "Occipital lobe",
      "Temporal lobe"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which fibers of the optic radiations pass through the temporal lobe and carry information from the superior visual fields?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Optic Radiations",
    "rationale": "Meyer's loop arcs anteriorly through the temporal lobe, carrying inferior retinal (superior field) information.",
    "choices": [
      "Meyer's loop",
      "Baum's loop",
      "Cuneus fibers",
      "Macular bundle"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A lesion of the right parietal optic radiations produces which defect?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Field Defects",
    "rationale": "Parietal radiations correspond to superior retinal (inferior visual field) fibers; a right lesion causes left inferior quadrantanopia.",
    "choices": [
      "Left inferior quadrantanopia",
      "Left superior quadrantanopia",
      "Right inferior quadrantanopia",
      "Bitemporal hemianopia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding distinguishes papilledema from optic neuritis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Differential-Papilledema vs Neuritis",
    "rationale": "Papilledema is typically bilateral with preserved central vision initially; optic neuritis causes painful, unilateral vision loss.",
    "choices": [
      "Preserved central vision early in papilledema",
      "Pain with eye movement in papilledema",
      "Unilateral involvement only",
      "Relative afferent pupillary defect in all papilledema cases"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic condition most commonly causes optic neuritis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Optic Neuritis",
    "rationale": "Optic neuritis is strongly associated with demyelination, often the initial manifestation of multiple sclerosis.",
    "choices": [
      "Multiple sclerosis",
      "Hypertension",
      "Diabetes mellitus",
      "Myasthenia gravis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which test best assesses functional conduction through the optic nerve to the visual cortex?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Testing",
    "rationale": "The VEP measures cortical responses to visual stimuli, detecting demyelination or conduction delays in the optic nerve.",
    "choices": [
      "Visual evoked potential (VEP)",
      "Electroretinogram (ERG)",
      "Fluorescein angiography",
      "Pupillometry"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In Leber hereditary optic neuropathy (LHON), which structure is primarily affected?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Inherited Neuropathy",
    "rationale": "LHON involves mitochondrial dysfunction leading to ganglion cell death, particularly in papillomacular fibers.",
    "choices": [
      "Retinal ganglion cell axons at the papillomacular bundle",
      "Photoreceptor outer segments",
      "RPE cells in the macula",
      "Choroidal vessels only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which lesion location produces a junctional scotoma (central scotoma in one eye with superior temporal defect in the other)?",
    "discipline": "Anatomy",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Field Defects",
    "rationale": "A junctional scotoma arises from a lesion at the optic chiasm compressing inferior nasal fibers crossing to the contralateral eye.",
    "choices": [
      "Optic chiasm involving the decussating inferior nasal fibers",
      "Optic tract",
      "LGN",
      "Occipital cortex"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which neurotransmitter is primarily involved in visual signal transmission between bipolar and ganglion cells?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Neurotransmission",
    "rationale": "Glutamate is the principal excitatory neurotransmitter released by photoreceptors and bipolar cells in visual transmission.",
    "choices": [
      "Glutamate",
      "Dopamine",
      "GABA",
      "Acetylcholine"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Optic disc pallor after previous edema indicates which pathophysiologic change?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Optic Nerve / Neuro-Ophthalmic Pathways",
    "sub": "Chronic Changes",
    "rationale": "Chronic atrophy following edema reflects axonal loss and gliosis within the optic nerve head.",
    "choices": [
      "Loss of retinal ganglion cell axons and gliosis",
      "Persistent axoplasmic stasis",
      "Increased vascular permeability",
      "Regeneration of optic nerve fibers"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which structure provides the primary resistance to aqueous outflow in the conventional pathway?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Outflow Anatomy",
    "rationale": "Most outflow resistance occurs within the juxtacanalicular portion of the trabecular meshwork before entry into Schlemm's canal.",
    "choices": [
      "Juxtacanalicular connective tissue of the trabecular meshwork",
      "Uveoscleral pathway",
      "Anterior chamber angle recess",
      "Schlemm's canal endothelium alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Aqueous humor exits the anterior chamber primarily through which two routes?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Glaucoma",
    "sub": "Aqueous Dynamics",
    "rationale": "Aqueous drains via the pressure-dependent trabecular route and the pressure-independent uveoscleral pathway.",
    "choices": [
      "Trabecular (conventional) and uveoscleral (unconventional) pathways",
      "Retinal and choroidal circulation",
      "Canal of Petit and Canal of Hannover",
      "Ciliary body secretion and diffusion"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which region of the optic nerve head is first affected by glaucomatous damage?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Optic Nerve Anatomy",
    "rationale": "The lamina cribrosa is the biomechanical weak point where axonal compression and vascular compromise occur in glaucoma.",
    "choices": [
      "Lamina cribrosa",
      "Prelaminar region",
      "Intraorbital segment",
      "Intracanalicular segment"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Elevated intraocular pressure causes optic nerve damage primarily through which mechanism?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Pathogenesis",
    "rationale": "Mechanical and vascular stress at the lamina cribrosa impedes axoplasmic transport and perfusion, leading to ganglion cell loss.",
    "choices": [
      "Axoplasmic flow obstruction and laminar deformation",
      "RPE detachment",
      "Photoreceptor apoptosis from light exposure",
      "Inflammatory demyelination"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which of the following is TRUE regarding diurnal variation of intraocular pressure (IOP)?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Physiology-IOP",
    "rationale": "Aqueous production increases and outflow decreases in the early morning, leading to physiologic IOP peaks.",
    "choices": [
      "IOP tends to peak in the early morning hours",
      "IOP is lowest in the morning",
      "IOP remains constant throughout the day",
      "IOP variation occurs only in myopes"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding best distinguishes open-angle glaucoma from angle-closure glaucoma?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Glaucoma",
    "sub": "Classification",
    "rationale": "Open-angle glaucoma has a structurally open angle but functional outflow impairment and characteristic optic neuropathy.",
    "choices": [
      "Open, normal-appearing angle with elevated IOP and optic neuropathy",
      "Intermittent shallowing of anterior chamber with normal IOP",
      "Sudden painful vision loss with mid-dilated pupil",
      "Congenital corneal edema and tearing"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which diagnostic finding is MOST characteristic of early glaucomatous visual field loss?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Visual Fields",
    "rationale": "Glaucomatous defects correspond to arcuate fiber bundles and typically respect the horizontal meridian early on.",
    "choices": [
      "Nasal step or paracentral scotoma respecting the horizontal meridian",
      "Central island loss",
      "Bitemporal hemianopia",
      "Generalized constriction without pattern"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Normal-tension glaucoma may result from which contributing mechanism?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Glaucoma",
    "sub": "NTG Mechanisms",
    "rationale": "NTG involves vascular insufficiency and susceptibility of the optic nerve despite statistically normal IOP.",
    "choices": [
      "Vascular dysregulation or reduced optic nerve perfusion pressure",
      "Elevated episcleral venous pressure",
      "Ciliary body hypersecretion",
      "Iris bombe formation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In primary angle-closure glaucoma, which anatomical feature predisposes to pupillary block?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Glaucoma",
    "sub": "Anatomy-Angle Closure",
    "rationale": "Short eyes with crowded anterior segments facilitate pupillary block and appositional angle closure.",
    "choices": [
      "Shallow anterior chamber and narrow angle due to short axial length",
      "Deep chamber with flat iris plane",
      "Large anterior chamber volume",
      "Thin cornea and long axial length"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which imaging modality best quantifies retinal nerve fiber layer (RNFL) thinning in glaucoma?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Glaucoma",
    "sub": "Imaging",
    "rationale": "OCT provides objective measurement of RNFL and ganglion cell complex thickness, detecting early glaucomatous damage.",
    "choices": [
      "Optical coherence tomography (OCT)",
      "Ultrasound biomicroscopy",
      "Fluorescein angiography",
      "Fundus autofluorescence"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which structure connects Schlemm's canal to the episcleral venous system?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Glaucoma",
    "sub": "Outflow Pathways",
    "rationale": "Collector channels and aqueous veins carry aqueous from Schlemm's canal to the episcleral venous circulation.",
    "choices": [
      "Collector channels and aqueous veins",
      "Iris root",
      "Scleral spur",
      "Ciliary body processes"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which medication class lowers IOP by increasing uveoscleral outflow?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Glaucoma",
    "sub": "Pharmacology",
    "rationale": "Prostaglandin analogs remodel the ciliary muscle extracellular matrix, enhancing uveoscleral outflow.",
    "choices": [
      "Prostaglandin analogs",
      "Beta-blockers",
      "Carbonic anhydrase inhibitors",
      "Alpha-agonists only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which acute symptom complex is most consistent with angle-closure crisis?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Angle-Closure Crisis",
    "rationale": "Acute angle-closure causes rapid IOP elevation with corneal edema, blurred vision, and a mid-dilated nonreactive pupil.",
    "choices": [
      "Severe ocular pain, halos, mid-dilated fixed pupil, corneal edema",
      "Bilateral gradual visual field loss",
      "Photophobia and tearing",
      "Painless unilateral vision loss"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding differentiates secondary open-angle glaucoma due to pseudoexfoliation?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Glaucoma",
    "sub": "Secondary Glaucomas",
    "rationale": "Pseudoexfoliation deposits fibrillar material on the lens and TM, increasing outflow resistance and trabecular pigmentation.",
    "choices": [
      "Flaky material on lens capsule and trabecular pigmentation",
      "Posterior synechiae formation",
      "Krukenberg spindle on endothelium only",
      "Peripheral anterior synechiae 360°"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which inherited condition is characterized by abnormal anterior chamber angle development in infancy?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Pediatric Glaucoma",
    "rationale": "Primary congenital glaucoma results from maldevelopment of the trabecular meshwork and Schlemm's canal, causing high IOP in infancy.",
    "choices": [
      "Primary congenital glaucoma",
      "Axenfeld-Rieger anomaly",
      "Sturge-Weber syndrome",
      "Marfan syndrome"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which surgical procedure creates a new fistula from the anterior chamber to the subconjunctival space to enhance outflow?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Surgical Management",
    "rationale": "Trabeculectomy forms a guarded filtration bleb to divert aqueous from the AC to the subconjunctival space, lowering IOP.",
    "choices": [
      "Trabeculectomy",
      "Laser peripheral iridotomy",
      "Cyclophotocoagulation",
      "Canaloplasty"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which optic nerve head feature is most specific for glaucomatous damage rather than physiologic cupping?",
    "discipline": "Anatomy",
    "condition": "Glaucoma",
    "sub": "Optic Nerve Evaluation",
    "rationale": "Glaucoma causes localized rim loss that violates the ISNT rule (Inferior > Superior > Nasal > Temporal rim thickness).",
    "choices": [
      "Notching of the neuroretinal rim violating the ISNT rule",
      "Large but symmetric cup in both eyes",
      "Pink neuroretinal rim with small cup",
      "Tilted disc with oblique insertion"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient presents with sudden severe eye pain after hammering metal. What is the most appropriate first diagnostic step?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Intraocular Foreign Body",
    "rationale": "CT is preferred to detect metallic foreign bodies; MRI is contraindicated because of risk of magnetic migration.",
    "choices": [
      "CT scan of the orbits without contrast",
      "Ultrasound B-scan",
      "MRI of the brain and orbits",
      "Tonometry"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding best differentiates an open-globe injury from a superficial laceration?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Globe Rupture",
    "rationale": "A positive Seidel test confirms aqueous leakage from a full-thickness defect consistent with an open globe.",
    "choices": [
      "Positive Seidel sign with leaking aqueous",
      "Localized subconjunctival hemorrhage",
      "Conjunctival laceration only",
      "Intact anterior chamber depth"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In orbital floor fracture, diplopia occurs most commonly due to entrapment of which muscle?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Orbital Anatomy",
    "rationale": "The inferior rectus lies adjacent to the thin orbital floor and can become trapped, causing limitation of upgaze and diplopia.",
    "choices": [
      "Inferior rectus",
      "Superior oblique",
      "Lateral rectus",
      "Medial rectus"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A patient with blunt trauma shows blood layering in the anterior chamber. Which complication must be closely monitored?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Hyphema",
    "rationale": "Rebleeding and trabecular obstruction by RBCs can elevate IOP; daily monitoring is essential.",
    "choices": [
      "Secondary IOP spike from trabecular blockage",
      "Posterior synechiae formation",
      "Hypotony from ciliary body shutdown",
      "Uveitis-glaucoma-hyphema syndrome"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which sign is most concerning for orbital compartment syndrome after trauma?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Orbital Pressure",
    "rationale": "Retrobulbar hemorrhage causing tense orbit and decreased vision is an emergency; lateral canthotomy/cantholysis is indicated.",
    "choices": [
      "Proptosis with tight lids and decreased vision",
      "Periorbital ecchymosis only",
      "Subconjunctival hemorrhage without proptosis",
      "Enophthalmos with diplopia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Chemical alkali injuries damage the cornea primarily by which mechanism?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Chemical Injury",
    "rationale": "Alkali causes liquefactive necrosis and penetrates rapidly, destroying collagen and limbal stem cells.",
    "choices": [
      "Saponification of cell membranes and deep tissue penetration",
      "Coagulation necrosis with surface barrier formation",
      "Superficial epithelial sloughing only",
      "Thermal denaturation of collagen alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which immediate management step takes precedence in chemical ocular burns?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Initial Management",
    "rationale": "Prompt irrigation with any available isotonic fluid to normalize pH prevents further chemical penetration and tissue loss.",
    "choices": [
      "Copious irrigation until physiologic pH is achieved",
      "Topical antibiotic application first",
      "Performing Seidel test",
      "Measuring visual acuity before irrigation"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "A 65-year-old with temporal headache and jaw claudication presents with sudden monocular vision loss. Which laboratory test is most urgent?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Giant Cell Arteritis",
    "rationale": "GCA threatens the fellow eye; ESR and CRP are critical for rapid diagnosis before starting systemic corticosteroids.",
    "choices": [
      "Erythrocyte sedimentation rate (ESR) and C-reactive protein (CRP)",
      "Serum ANA",
      "Angiotensin-converting enzyme level",
      "Lysozyme assay"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "After a blow-out fracture, the globe appears sunken with enophthalmos. Which anatomic defect explains this finding?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Orbital Volume",
    "rationale": "Orbital floor fracture allows herniation of orbital contents into the maxillary sinus, reducing intraorbital volume and producing enophthalmos.",
    "choices": [
      "Loss of orbital volume due to herniation of fat into maxillary sinus",
      "Superior wall collapse into frontal sinus",
      "Medial wall fracture into ethmoid cells",
      "Zygomatic arch fracture alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which finding indicates optic nerve avulsion following severe blunt ocular trauma?",
    "discipline": "Anatomy",
    "condition": "Emergencies / Trauma",
    "sub": "Optic Nerve Trauma",
    "rationale": "Optic nerve avulsion causes immediate, irreversible vision loss with absent APD and a normal-appearing anterior segment.",
    "choices": [
      "Profound vision loss with absent afferent pupillary response but normal-appearing globe",
      "Subconjunctival hemorrhage and chemosis only",
      "Optic disc swelling with pain on movement",
      "Mild field defect with normal vision"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which autonomic receptor subtype most directly mediates pupillary dilation via the iris dilator muscle?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Receptors",
    "rationale": "Iris dilator contraction is driven by sympathetic α1 stimulation.",
    "choices": [
      "α1 adrenergic",
      "β2 adrenergic",
      "M3 muscarinic",
      "Nicotinic"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which vitamin is essential for rhodopsin regeneration and night vision?",
    "discipline": "Biochemistry / Physiology",
    "condition": "Systemic Health",
    "sub": "Physiology",
    "rationale": "11-cis-retinal (vitamin A derivative) recombines with opsin to form rhodopsin.",
    "choices": [
      "Vitamin A (retinol)",
      "Vitamin C",
      "Vitamin D",
      "Vitamin K"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic condition classically causes granulomatous anterior uveitis with elevated ACE and bilateral hilar lymphadenopathy?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Pathophysiology",
    "rationale": "Noncaseating granulomas in sarcoid trigger granulomatous ocular inflammation.",
    "choices": [
      "Sarcoidosis",
      "Multiple sclerosis",
      "Ulcerative colitis",
      "Myasthenia gravis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Ethambutol toxicity most typically presents with which ocular finding?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Drug Toxicity",
    "rationale": "Ethambutol optic neuropathy affects papillomacular bundle with color loss.",
    "choices": [
      "Bilateral cecocentral scotomas and red-green dyschromatopsia",
      "Arcuate field loss with normal color vision",
      "Blue-yellow defect only",
      "Peripheral ring scotoma without dyschromatopsia"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which antimalarial dosing threshold minimizes risk of hydroxychloroquine maculopathy?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Drug Safety",
    "rationale": "Current guidance uses ACTUAL body weight with ≤5 mg/kg/day to lower risk.",
    "choices": [
      "≤5 mg/kg/day using actual body weight",
      "≤6.5 mg/kg/day using ideal body weight",
      "≤3 mg/kg/day using ideal body weight",
      "Dose is unrelated to risk"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic medication can precipitate acute myopic shift and secondary angle closure from choroidal effusions?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Adverse Effects",
    "rationale": "Topiramate can cause uveal effusion with forward movement of the lens-iris diaphragm.",
    "choices": [
      "Topiramate",
      "Lisinopril",
      "Metformin",
      "Levothyroxine"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Tamoxifen is most associated with which ocular toxicity?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Drug Toxicity",
    "rationale": "Long-term tamoxifen can cause crystalline deposits and macular edema.",
    "choices": [
      "Crystalline maculopathy with possible CME",
      "Classic vortex keratopathy only",
      "Blue-yellow color defect",
      "Rapid NAION in all users"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Amiodarone most commonly produces which ocular change?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Drug Toxicity",
    "rationale": "Cationic amphiphilic drugs like amiodarone cause corneal verticillata.",
    "choices": [
      "Vortex (whorl) keratopathy",
      "Kayser-Fleischer ring",
      "Band keratopathy",
      "Corneal guttata"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antibiotic is relatively safe in pregnancy for ocular infections?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Drug Choice",
    "rationale": "Penicillins and most cephalosporins are generally considered safe; tetracyclines are avoided.",
    "choices": [
      "Amoxicillin",
      "Tetracycline",
      "Doxycycline",
      "Fluoroquinolone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which endocrine disease leads to fluctuating diplopia, lid retraction, and restrictive strabismus due to extraocular muscle fibrosis?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Pathophysiology",
    "rationale": "Autoimmune inflammation targets EOMs, especially the inferior rectus.",
    "choices": [
      "Thyroid eye disease (Graves orbitopathy)",
      "Cushing disease",
      "Addison disease",
      "Hyperparathyroidism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "In diabetes mellitus, which mechanism most directly causes diabetic macular edema?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Vascular Leakage",
    "rationale": "Pericyte loss and endothelial dysfunction disrupt tight junctions, causing edema.",
    "choices": [
      "Breakdown of inner blood-retinal barrier with capillary leakage",
      "Autoimmune attack on photoreceptors",
      "RPE pump failure only",
      "Increased episcleral venous pressure"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Giant cell arteritis threatens vision primarily by ischemia of which structure?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "AION",
    "rationale": "Arteritic AION results from PCA involvement; urgent steroids are vision-saving.",
    "choices": [
      "Posterior ciliary arteries supplying the optic nerve head",
      "Central retinal vein",
      "Short posterior ciliary nerves",
      "Lacrimal artery only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which two labs are most immediately useful when suspecting giant cell arteritis?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Diagnostics",
    "rationale": "Both ESR and CRP typically elevate and guide urgent treatment.",
    "choices": [
      "ESR and CRP",
      "ANA and RF",
      "ACE and lysozyme",
      "TSH and free T4"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which HIV-related opportunistic infection most commonly causes necrotizing retinitis with granular borders and hemorrhage?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Ocular Opportunists",
    "rationale": "CMV causes fulminant necrotizing retinitis in advanced immunosuppression.",
    "choices": [
      "CMV retinitis",
      "Toxoplasma chorioretinitis",
      "PJP",
      "Adenoviral retinitis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic drug interaction increases INR/bleeding risk with warfarin and may present with subconjunctival hemorrhages?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Interactions",
    "rationale": "CYP inhibition by macrolides/azoles elevates warfarin effect.",
    "choices": [
      "Macrolide or azole antifungal co-administration",
      "Coenzyme Q10",
      "Calcium supplements",
      "Levothyroxine alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which inherited hemoglobinopathy increases risk of IOP spikes and optic nerve damage with hyphema?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Trauma Physiology",
    "rationale": "Sickling impedes trabecular outflow; avoid systemic CAIs which acidify blood.",
    "choices": [
      "Sickle cell disease/trait",
      "Thalassemia minor",
      "G6PD deficiency",
      "Hereditary spherocytosis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antibiotic class should be avoided in children due to risk of tooth discoloration and bone effects?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Safety",
    "rationale": "Tetracyclines chelate calcium and affect developing teeth/bone.",
    "choices": [
      "Tetracyclines",
      "Penicillins",
      "Cephalosporins",
      "Macrolides"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which neurologic disease most commonly presents with painful unilateral optic neuritis in young adults?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Demyelination",
    "rationale": "Optic neuritis is tightly linked to demyelinating disease such as MS.",
    "choices": [
      "Multiple sclerosis",
      "Parkinson disease",
      "ALS",
      "Myasthenia gravis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which test confirms neurosyphilis in a patient with uveitis and positive treponemal screening?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Diagnostics",
    "rationale": "CSF VDRL supports neurosyphilis; treat with IV penicillin.",
    "choices": [
      "CSF VDRL (with lumbar puncture)",
      "ANA titer",
      "Serum ACE",
      "Lyme ELISA only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic drug is a strong risk for IFIS (intraoperative floppy iris syndrome)?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Surgery Risk",
    "rationale": "α1A blockade affects iris dilator tone; alert the surgeon.",
    "choices": [
      "Tamsulosin",
      "Amlodipine",
      "Metformin",
      "Losartan"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which cardiac medication class can cause xanthopsia (yellow vision) and dyschromatopsia?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Toxicity",
    "rationale": "Digoxin toxicity produces color vision changes including yellow tinges.",
    "choices": [
      "Cardiac glycosides (e.g., digoxin)",
      "ACE inhibitors",
      "ARBs",
      "Thiazides"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antifungal used for onychomycosis can cause optic neuritis and should prompt ocular review if vision symptoms arise?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Adverse Effects",
    "rationale": "Voriconazole has known neuro-ocular toxicities at therapeutic levels.",
    "choices": [
      "Voriconazole",
      "Terbinafine",
      "Fluconazole",
      "Nystatin (topical)"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which vitamin deficiency is associated with Bitot spots and xerophthalmia?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Ocular Signs",
    "rationale": "Vitamin A deficiency impairs goblet cells and epithelial health.",
    "choices": [
      "Vitamin A deficiency",
      "Vitamin B12 deficiency",
      "Vitamin E deficiency",
      "Vitamin C deficiency"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antihypertensive is relatively contraindicated in asthmatics due to bronchospasm risk and can mask hypoglycemia?",
    "discipline": "Anatomy",
    "condition": "Lens / Cataract / IOL / Pre- & Post-Op Care",
    "sub": "Safety",
    "rationale": "β2 blockade provokes bronchospasm; β-blockers also blunt hypoglycemic symptoms.",
    "choices": [
      "Nonselective β-blockers (e.g., propranolol)",
      "ACE inhibitors",
      "ARBs",
      "Dihydropyridine CCBs"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic diuretic is a carbonic anhydrase inhibitor used to lower IOP but is cautioned in sickle cell disease?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "IOP / Hematology",
    "rationale": "Systemic CAIs acidify blood and can promote sickling; use caution.",
    "choices": [
      "Acetazolamide",
      "Furosemide",
      "Hydrochlorothiazide",
      "Spironolactone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Interferon-α therapy for hepatitis can cause which retinal change?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Drug Toxicity",
    "rationale": "Microvascular ischemia manifests with CWS and hemorrhages.",
    "choices": [
      "Cotton-wool spots and retinal hemorrhages (interferon retinopathy)",
      "Bull's-eye maculopathy",
      "Elschnig spots",
      "Cherry-red spot"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Linezolid prolonged therapy is associated with which neuro-ophthalmic complication?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Adverse Effects",
    "rationale": "Mitochondrial toxicity can lead to optic neuropathy after weeks of therapy.",
    "choices": [
      "Optic neuropathy with color vision loss",
      "Central serous chorioretinopathy",
      "Papilledema from IIH",
      "Night blindness"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic disease is most associated with episcleritis that blanches with phenylephrine and is often benign?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Association",
    "rationale": "Episcleritis frequently accompanies IBD, RA, and other autoimmune conditions.",
    "choices": [
      "Inflammatory bowel disease",
      "Parkinson disease",
      "Myasthenia gravis",
      "Hypothyroidism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Wilson disease can show which distinctive corneal sign due to copper deposition?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Anatomy / Sign",
    "rationale": "Copper deposits at Descemet's periphery produce a golden-brown ring.",
    "choices": [
      "Kayser-Fleischer ring at Descemet's",
      "Hudson-Stähli line",
      "Stocker line",
      "Fleischer ring at cone base"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic medication can exacerbate dry eye by reducing aqueous secretion through anticholinergic effects?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Tear Film",
    "rationale": "Anticholinergic burden reduces lacrimation and salivation.",
    "choices": [
      "Tricyclic antidepressants",
      "ACE inhibitors",
      "Metformin",
      "ARBs"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which vitamin toxicity can cause pseudotumor cerebri (IIH) symptoms including papilledema?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Intracranial Pressure",
    "rationale": "Hypervitaminosis A is a known trigger for IIH.",
    "choices": [
      "Vitamin A excess",
      "Vitamin C excess",
      "Vitamin D excess only",
      "Vitamin E excess only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which endocrine disorder is most associated with bitemporal hemianopia from chiasmal compression?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Visual Pathway",
    "rationale": "Pituitary macroadenomas compress decussating nasal fibers at the chiasm.",
    "choices": [
      "Pituitary adenoma (hyperprolactinemia common)",
      "Primary hyperparathyroidism",
      "Adrenal insufficiency",
      "Thyroid storm"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Sildenafil and related PDE-5 inhibitors have been associated (rarely) with which optic event?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Risk Note",
    "rationale": "An association with NAION is reported; counsel patients with crowded discs and vascular risk.",
    "choices": [
      "Non-arteritic anterior ischemic optic neuropathy (NAION)",
      "Toxic optic neuritis",
      "Papilledema",
      "Traumatic optic neuropathy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic condition most classically causes salt-and-pepper fundus changes?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Retinal Signs",
    "rationale": "Congenital rubella syndrome may show mottled RPE (salt-and-pepper).",
    "choices": [
      "Congenital rubella",
      "Measles (rubeola)",
      "Varicella",
      "Mumps"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which blood dyscrasia increases risk for retinal vein occlusion and should be considered in young patients?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Hypercoagulability",
    "rationale": "Inherited thrombophilias predispose to venous occlusive disease.",
    "choices": [
      "Factor V Leiden thrombophilia",
      "Iron deficiency anemia",
      "Hemophilia A only",
      "Polycythemia absence"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antitubercular regimen component is most associated with optic neuropathy risk?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Toxicity",
    "rationale": "Ethambutol dose and duration correlate with optic neuropathy risk.",
    "choices": [
      "Ethambutol",
      "Rifampin",
      "Isoniazid",
      "Pyrazinamide"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which autoimmune disease is most associated with peripheral ulcerative keratitis (PUK) and scleritis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Corneoscleral",
    "rationale": "RA vasculitis can cause PUK and necrotizing scleritis.",
    "choices": [
      "Rheumatoid arthritis",
      "Hashimoto thyroiditis",
      "Psoriasis alone",
      "Vitiligo"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic lipid disorder classically produces a corneal arcus at a young age?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Corneal Signs",
    "rationale": "Early arcus in patients <40 suggests significant hypercholesterolemia.",
    "choices": [
      "Familial hypercholesterolemia",
      "Familial combined hyperlipidemia",
      "Hypolipidemia",
      "Tangier disease only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which antibiotic pair is preferred for classic toxoplasma chorioretinitis?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Therapy",
    "rationale": "Standard therapy combines folate antagonists plus leucovorin rescue.",
    "choices": [
      "Pyrimethamine + sulfadiazine (with leucovorin)",
      "Acyclovir + valacyclovir",
      "Ciprofloxacin + metronidazole",
      "Azithromycin + doxycycline only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic medication commonly causes whorl keratopathy besides amiodarone?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Corneal Effects",
    "rationale": "Chloroquine and other cationic amphiphiles cause verticillata.",
    "choices": [
      "Chloroquine",
      "Warfarin",
      "Losartan",
      "Metformin"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which neurologic autoimmune disorder causes fatigable ptosis and diplopia with positive ice-pack test?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Neuromuscular Junction",
    "rationale": "MG targets postsynaptic ACh receptors; ocular symptoms are common.",
    "choices": [
      "Myasthenia gravis",
      "Guillain-Barré",
      "ALS",
      "Lambert-Eaton only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which endocrine disorder is associated with cotton-wool spots, microaneurysms, and neovascularization?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Retinopathy",
    "rationale": "Chronic hyperglycemia damages capillaries leading to DR.",
    "choices": [
      "Diabetes mellitus",
      "Hypothyroidism",
      "Pheochromocytoma",
      "Acromegaly without DM"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antihypertensive medication can cause conjunctival hyperemia as a common side effect when used topically for glaucoma analogs?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Ocular Surface",
    "rationale": "Topical PGAs commonly cause redness, lash growth, and periorbitopathy.",
    "choices": [
      "Prostaglandin analogs (class effect noted topically)",
      "ACE inhibitors systemically",
      "ARBs systemically",
      "Thiazides systemically"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which neurologic condition presents with increased ICP, papilledema, headache, and transient visual obscurations, commonly in young obese females?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Papilledema",
    "rationale": "IIH (pseudotumor) features elevated opening pressure with normal imaging.",
    "choices": [
      "Idiopathic intracranial hypertension",
      "Normal pressure hydrocephalus",
      "Ischemic stroke",
      "Parkinson disease"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which thyroid medication overdose can cause lid lag and stare with sympathetic overactivity signs?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Physiology",
    "rationale": "Excess thyroid hormone increases sympathetic tone causing lid retraction/lag.",
    "choices": [
      "Excess levothyroxine causing thyrotoxicosis",
      "Methimazole excess",
      "Propylthiouracil excess",
      "Iodide deficiency"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic malignancy is notorious for choroidal metastasis presenting as creamy subretinal lesions?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Metastasis",
    "rationale": "Breast and lung are the most common sources to the choroid.",
    "choices": [
      "Breast carcinoma",
      "Colon carcinoma",
      "Prostate carcinoma",
      "Glioblastoma"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which connective tissue disorder is associated with lens subluxation and increased axial length?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Ocular Anatomy",
    "rationale": "Fibrillin-1 defects lead to ectopia lentis (superotemporal).",
    "choices": [
      "Marfan syndrome",
      "Ehlers-Danlos only",
      "Osteogenesis imperfecta only",
      "Ankylosing spondylitis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic drug is contraindicated in pregnancy and can cause fetal renal anomalies and skull defects?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Teratogens",
    "rationale": "ACE inhibitors/ARBs are teratogenic (especially 2nd/3rd trimesters).",
    "choices": [
      "ACE inhibitors",
      "Penicillins",
      "Erythromycin base",
      "Heparin"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which autoimmune disease classically produces dry eye with parotid enlargement and positive anti-Ro/SSA?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Exocrine Glands",
    "rationale": "Lacrimal and salivary gland infiltration causes aqueous-deficient dry eye.",
    "choices": [
      "Sjögren syndrome",
      "RA alone",
      "SLE only",
      "Dermatomyositis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic agent increases uveoscleral outflow when used as an oral prodrug for glaucoma is NOT used; instead, which topical analogs are standard?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Mechanism",
    "rationale": "Glaucoma therapy relies on topical PGAs to remodel ciliary muscle ECM.",
    "choices": [
      "Topical prostaglandin analogs (latanoprost/travoprost/bimatoprost)",
      "Systemic prostaglandins",
      "Oral β-blockers",
      "Oral carbonic anhydrase inhibitors only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic vasculitis is strongly linked with HLA-B27 and can cause recurrent acute anterior uveitis?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "HLA Associations",
    "rationale": "HLA-B27 spondyloarthropathies commonly have AAU flares.",
    "choices": [
      "Ankylosing spondylitis",
      "Granulomatosis with polyangiitis",
      "Polyarteritis nodosa",
      "Takayasu arteritis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antiplatelet/anticoagulant combination raises risk of ocular hemorrhage during intravitreal injections?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Bleeding Risk",
    "rationale": "Combined anticoagulation/antiplatelet therapy increases bleeding risk.",
    "choices": [
      "Warfarin + dual antiplatelet therapy",
      "Clopidogrel alone",
      "Aspirin alone (low-dose)",
      "Rivaroxaban monotherapy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic disorder is associated with Lisch nodules on the iris and optic pathway gliomas?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Ocular Signs",
    "rationale": "NF1 shows café-au-lait macules, neurofibromas, iris hamartomas.",
    "choices": [
      "Neurofibromatosis type 1",
      "NF2",
      "Tuberous sclerosis",
      "Sturge-Weber"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which hepatic disease causes conjunctival and scleral icterus due to bilirubin deposition?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Anatomy / Pigment",
    "rationale": "Elevated bilirubin stains elastin-rich tissues including sclera.",
    "choices": [
      "Cholestatic jaundice",
      "Hepatic steatosis without cholestasis",
      "Hemochromatosis only",
      "Gilbert syndrome never does"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which pulmonary disease therapy can cause raised IOP and posterior subcapsular cataracts with chronic use?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Adverse Effects",
    "rationale": "Steroids increase IOP in responders and predispose to PSC cataracts.",
    "choices": [
      "Systemic and inhaled corticosteroids",
      "β2-agonists",
      "Leukotriene antagonists",
      "Anticholinergics alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which renal disease finding is associated with cotton-wool spots due to hypertension?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Microvasculature",
    "rationale": "Chronic HTN causes arteriolar narrowing, CWS, and hemorrhages.",
    "choices": [
      "Hypertensive retinopathy from chronic kidney disease",
      "Nephrotic syndrome only",
      "Renal colic",
      "Polycystic kidney disease never shows this"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which endocrine emergency presents with Kussmaul respirations, dehydration, and blurred vision from hyperosmolarity?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Metabolic",
    "rationale": "DKA features acidosis and marked hyperglycemia causing lens swelling and refractive shifts.",
    "choices": [
      "Diabetic ketoacidosis",
      "Myxedema coma",
      "Adrenal crisis",
      "Thyroid storm"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which malignancy is associated with Roth spots (white-centered retinal hemorrhages) due to septic emboli?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Retinal Signs",
    "rationale": "Roth spots occur in endocarditis from immune complex vasculitis and emboli.",
    "choices": [
      "Infective endocarditis",
      "Acute lymphoblastic leukemia only",
      "Melanoma",
      "Basal cell carcinoma"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which neurologic infectious disease causes Argyll Robertson pupils (light-near dissociation)?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Pupil Physiology",
    "rationale": "AR pupils accommodate but do not react to light; classic for neurosyphilis.",
    "choices": [
      "Neurosyphilis",
      "Neuroborreliosis",
      "Viral encephalitis",
      "Toxoplasmosis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic cancer therapy is most associated with MEK-inhibitor retinopathy (SRF at the macula)?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Drug Toxicity",
    "rationale": "MEK inhibitors can produce reversible serous maculopathy.",
    "choices": [
      "BRAF/MEK pathway inhibitors",
      "Platinum agents",
      "Anthracyclines",
      "Taxanes only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which neurologic channelopathy causes night blindness and progressive constricted fields with bone-spicule pigmentation?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Retinal Degeneration",
    "rationale": "RP features rod dysfunction first with nyctalopia and mid-peripheral scotomas.",
    "choices": [
      "Retinitis pigmentosa (many genetic causes)",
      "Best disease",
      "Stargardt disease",
      "Leber congenital amaurosis only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which hematologic malignancy can cause hyperviscosity retinopathy with dilated tortuous veins and hemorrhages?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Vascular",
    "rationale": "IgM paraproteinemia increases serum viscosity causing retinal changes.",
    "choices": [
      "Waldenström macroglobulinemia",
      "AML only",
      "ITP",
      "Hemophilia B"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which endocrine therapy can cause color vision changes and optic neuritis-like picture (rare)?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Rare Toxicity",
    "rationale": "Tamoxifen has multiple ocular toxicities beyond crystalline maculopathy.",
    "choices": [
      "Tamoxifen (rare ON-like toxicity)",
      "Insulin",
      "Levothyroxine",
      "Hydrocortisone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic antibiotics are most associated with risk of tendinopathy and may precipitate uveitis (rare reports)?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Adverse Effects",
    "rationale": "FQs carry boxed warning for tendons; uveitis is rare but reported.",
    "choices": [
      "Fluoroquinolones",
      "Penicillins",
      "Cephalosporins",
      "Macrolides only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic immunotherapy can produce uveitis and serous retinal detachments as an adverse event?",
    "discipline": "Pharmacology",
    "condition": "Systemic Health",
    "sub": "Immune-Related AEs",
    "rationale": "Immune checkpoint inhibitors can cause ocular irAEs including uveitis and CSR-like changes.",
    "choices": [
      "Checkpoint inhibitors (e.g., anti-PD-1/PD-L1)",
      "TNF-α inhibitors never do",
      "Interleukin-2 never does",
      "IVIG only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic deficiency state causes optic neuropathy with central scotomas and anemia?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Optic Nerve",
    "rationale": "B12 deficiency can produce retrobulbar optic neuropathy and megaloblastic anemia.",
    "choices": [
      "Vitamin B12 deficiency",
      "Folate excess",
      "Vitamin C deficiency",
      "Zinc deficiency only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic pediatric tumor is associated with leukocoria and requires urgent evaluation?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Screening",
    "rationale": "Leukocoria in a child is RB until proven otherwise.",
    "choices": [
      "Retinoblastoma",
      "Medulloblastoma",
      "Wilms tumor",
      "Neuroblastoma"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic autoimmune disease shows a malar rash and can cause cotton-wool spots and vaso-occlusive retinopathy?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Retinal Vascular",
    "rationale": "Immune complex vasculitis in SLE produces retinal ischemia and hemorrhages.",
    "choices": [
      "Systemic lupus erythematosus",
      "Sjögren syndrome",
      "Ankylosing spondylitis",
      "Psoriatic arthritis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic metabolic disorder classically causes cherry-red spot at the macula in infants?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Retinal Sign",
    "rationale": "GM2 gangliosidosis spares foveal RPE, creating a red spot against pale retina.",
    "choices": [
      "Tay-Sachs disease",
      "Von Gierke disease",
      "Hemochromatosis",
      "Adrenoleukodystrophy"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic analgesic is contraindicated with narrow-angle glaucoma due to anticholinergic effects exacerbating angle closure?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Angle Closure Risk",
    "rationale": "Anticholinergic/antihistaminic agents may dilate pupils and precipitate closure in susceptible angles.",
    "choices": [
      "High-dose first-generation antihistamine combinations",
      "Acetaminophen",
      "NSAIDs",
      "Opioids alone"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic disease produces Langerhans cell histiocytosis with possible orbital masses and proptosis in children?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Orbit",
    "rationale": "LCH can involve orbit causing bone lesions and proptosis.",
    "choices": [
      "Histiocytosis X (LCH)",
      "Sarcoidosis only",
      "RA",
      "SLE"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which vitamin deficiency causes perifollicular hemorrhages and delayed wound healing that may worsen subconjunctival hemorrhages?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Vascular Fragility",
    "rationale": "Ascorbate is needed for collagen crosslinking; deficiency weakens vessels.",
    "choices": [
      "Vitamin C deficiency (scurvy)",
      "Vitamin D deficiency",
      "Vitamin E deficiency",
      "Vitamin K deficiency only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic endocrine therapy can cause increased IOP and open-angle glaucoma risk with chronic use?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Glaucoma Risk",
    "rationale": "Steroid responders develop outflow resistance at the TM.",
    "choices": [
      "Systemic corticosteroids",
      "Insulin",
      "Levothyroxine",
      "Metformin"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which neurologic/paraneoplastic syndrome causes rapid ophthalmoplegia, ataxia, and areflexia following infection?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Ocular Motility",
    "rationale": "Miller Fisher (anti-GQ1b) presents with ophthalmoplegia and ataxia.",
    "choices": [
      "Miller Fisher variant of Guillain-Barré",
      "Lambert-Eaton syndrome",
      "MS relapse",
      "Myasthenic crisis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic endocrine abnormality causes thickened extraocular muscles sparing tendons on imaging?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Imaging",
    "rationale": "TED shows fusiform EOM enlargement with tendon sparing.",
    "choices": [
      "Thyroid eye disease",
      "Acromegaly",
      "Cushing disease",
      "Hyperparathyroidism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic drug is safest for treating acute bacterial sinusitis in a pregnant patient with preseptal cellulitis risk?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Antibiotic Choice",
    "rationale": "β-lactams are generally safe; tetracyclines, TMP-SMX (early), and FQs are avoided.",
    "choices": [
      "Amoxicillin-clavulanate",
      "Doxycycline",
      "Levofloxacin",
      "Trimethoprim-sulfamethoxazole (1st trimester)"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic immunosuppressant blocks calcineurin to reduce IL-2 transcription and is used in transplant patients with possible ocular side effects (e.g., tremor, neurotoxicity)?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Mechanism",
    "rationale": "Tacrolimus is a calcineurin inhibitor; monitor for neuro- and nephrotoxicity.",
    "choices": [
      "Tacrolimus",
      "Azathioprine",
      "Methotrexate",
      "Mycophenolate"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic cancer in men commonly metastasizes to the choroid causing amelanotic lesions?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Metastasis",
    "rationale": "Breast (women) and lung (men/women) are top sources of choroidal mets.",
    "choices": [
      "Lung carcinoma",
      "Prostate carcinoma",
      "Colon carcinoma",
      "Renal cell carcinoma only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic mitochondrial disease presents with painless central vision loss in young men and temporal disc pallor?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Optic Neuropathy",
    "rationale": "LHON affects papillomacular bundle due to mitochondrial mutations.",
    "choices": [
      "Leber hereditary optic neuropathy",
      "Dominant optic atrophy only",
      "Friedreich ataxia",
      "MELAS without optic features"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic endocrine disorder is linked to central serous chorioretinopathy through cortisol excess?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Choroid",
    "rationale": "Endogenous or exogenous steroids increase CSC risk.",
    "choices": [
      "Cushing syndrome",
      "Addison disease",
      "Hypothyroidism",
      "Hyperparathyroidism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic medication class is most likely to precipitate angle closure by pupillary block through mydriasis?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Angle Closure",
    "rationale": "Mydriasis in narrow angles can obstruct trabecular outflow.",
    "choices": [
      "Anticholinergic and adrenergic agonists",
      "ACE inhibitors",
      "Statins",
      "Metformin"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic autoimmune blistering disease shows conjunctival scarring and symblepharon risk?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Conjunctiva",
    "rationale": "Autoantibodies to basement membrane cause cicatrization.",
    "choices": [
      "Mucous membrane pemphigoid (ocular cicatricial pemphigoid)",
      "Pemphigus vulgaris only",
      "Atopic dermatitis",
      "Psoriasis"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic bone medication has been associated with scleritis and uveitis (rare) and requires cessation if inflammation occurs?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Inflammatory AEs",
    "rationale": "Bisphosphonates have rare ocular inflammatory adverse effects.",
    "choices": [
      "Bisphosphonates",
      "Calcitonin",
      "Calcium carbonate",
      "Vitamin D only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic nutritional deficiency can cause nystagmus, ataxia, and ophthalmoplegia (Wernicke encephalopathy)?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Ocular Motility",
    "rationale": "B1 deficiency (often alcoholism) causes acute neuro-ophthalmic signs.",
    "choices": [
      "Thiamine (B1) deficiency",
      "Niacin (B3) deficiency",
      "Riboflavin (B2) deficiency",
      "Pyridoxine (B6) deficiency"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic autoimmune disease presents with pannus formation and keratolysis leading to corneal melting?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Cornea",
    "rationale": "RA-associated vasculitis at the periphery can cause PUK and melt.",
    "choices": [
      "Rheumatoid arthritis (PUK)",
      "Sjögren syndrome only",
      "Hashimoto",
      "Sarcoid without corneal melt"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic endocrine abnormality increases risk for nonarteritic anterior ischemic optic neuropathy?",
    "discipline": "Immunology / Microbiology / Pathology",
    "condition": "Systemic Health",
    "sub": "Optic Nerve",
    "rationale": "OSA contributes to nocturnal hypotension and vascular dysregulation.",
    "choices": [
      "Obstructive sleep apnea",
      "Hyperthyroidism",
      "Addison disease",
      "Hypoparathyroidism"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic supplement at very high doses can cause intracranial hypertension similar to vitamin A excess?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "IIH Risks",
    "rationale": "Vitamin A excess and tetracyclines are classic IIH triggers.",
    "choices": [
      "Tetracyclines (drug, not supplement) and high vitamin A; high B6 causes neuropathy instead",
      "High vitamin C",
      "High vitamin E",
      "Omega-3 only"
    ],
    "correct": 0
  },
  {
    "id": null,
    "text": "Which systemic enzyme deficiency causes angiokeratomas, corneal verticillata, and painful neuropathy?",
    "discipline": "Anatomy",
    "condition": "Systemic Health",
    "sub": "Corneal Sign",
    "rationale": "Fabry produces whorl keratopathy and systemic vasculopathy.",
    "choices": [
      "Fabry disease (α-galactosidase A deficiency)",
      "Gaucher disease",
      "Pompe disease",
      "Hunter syndrome"
    ],
    "correct": 0
  }
]
